def @main(%input: Tensor[(1, 3, 128, 128), int8], %v0_weight: Tensor[(16, 3, 3, 3), int8], %v0_bias: Tensor[(16), int32], %v0_zero_x: Tensor[(1), int8], %v0_zero_y: Tensor[(1), int8], %v0_scale: Tensor[(16), float32], %v1_conv_0_weight: Tensor[(16, 1, 3, 3), int8], %v1_conv_0_bias: Tensor[(16), int32], %v1_conv_0_zero_x: Tensor[(1), int8], %v1_conv_0_zero_y: Tensor[(1), int8], %v1_conv_0_scale: Tensor[(16), float32], %v1_conv_1_weight: Tensor[(8, 16, 1, 1), int8], %v1_conv_1_bias: Tensor[(8), int32], %v1_conv_1_zero_x: Tensor[(1), int8], %v1_conv_1_zero_y: Tensor[(1), int8], %v1_conv_1_scale: Tensor[(8), float32], %v2_conv_0_weight: Tensor[(32, 8, 1, 1), int8], %v2_conv_0_bias: Tensor[(32), int32], %v2_conv_0_zero_x: Tensor[(1), int8], %v2_conv_0_zero_y: Tensor[(1), int8], %v2_conv_0_scale: Tensor[(32), float32], %v2_conv_1_weight: Tensor[(32, 1, 3, 3), int8], %v2_conv_1_bias: Tensor[(32), int32], %v2_conv_1_zero_x: Tensor[(1), int8], %v2_conv_1_zero_y: Tensor[(1), int8], %v2_conv_1_scale: Tensor[(32), float32], %v2_conv_2_weight: Tensor[(16, 32, 1, 1), int8], %v2_conv_2_bias: Tensor[(16), int32], %v2_conv_2_zero_x: Tensor[(1), int8], %v2_conv_2_zero_y: Tensor[(1), int8], %v2_conv_2_scale: Tensor[(16), float32], %v3_conv_0_weight: Tensor[(48, 16, 1, 1), int8], %v3_conv_0_bias: Tensor[(48), int32], %v3_conv_0_zero_x: Tensor[(1), int8], %v3_conv_0_zero_y: Tensor[(1), int8], %v3_conv_0_scale: Tensor[(48), float32], %v3_conv_1_weight: Tensor[(48, 1, 3, 3), int8], %v3_conv_1_bias: Tensor[(48), int32], %v3_conv_1_zero_x: Tensor[(1), int8], %v3_conv_1_zero_y: Tensor[(1), int8], %v3_conv_1_scale: Tensor[(48), float32], %v3_conv_2_weight: Tensor[(16, 48, 1, 1), int8], %v3_conv_2_bias: Tensor[(16), int32], %v3_conv_2_zero_x: Tensor[(1), int8], %v3_conv_2_zero_y: Tensor[(1), int8], %v3_conv_2_scale: Tensor[(16), float32], %v3_qadd_zero_x1: Tensor[(1), int8], %v3_qadd_zero_x2: Tensor[(1), int8], %v3_qadd_scale_x1: Tensor[(1), float32], %v3_qadd_scale_x2: Tensor[(1), float32], %v3_qadd_zero_y: Tensor[(1), int8], %v3_qadd_scale_y: Tensor[(1), float32], %v4_conv_0_weight: Tensor[(48, 16, 1, 1), int8], %v4_conv_0_bias: Tensor[(48), int32], %v4_conv_0_zero_x: Tensor[(1), int8], %v4_conv_0_zero_y: Tensor[(1), int8], %v4_conv_0_scale: Tensor[(48), float32], %v4_conv_1_weight: Tensor[(48, 1, 7, 7), int8], %v4_conv_1_bias: Tensor[(48), int32], %v4_conv_1_zero_x: Tensor[(1), int8], %v4_conv_1_zero_y: Tensor[(1), int8], %v4_conv_1_scale: Tensor[(48), float32], %v4_conv_2_weight: Tensor[(24, 48, 1, 1), int8], %v4_conv_2_bias: Tensor[(24), int32], %v4_conv_2_zero_x: Tensor[(1), int8], %v4_conv_2_zero_y: Tensor[(1), int8], %v4_conv_2_scale: Tensor[(24), float32], %v5_conv_0_weight: Tensor[(120, 24, 1, 1), int8], %v5_conv_0_bias: Tensor[(120), int32], %v5_conv_0_zero_x: Tensor[(1), int8], %v5_conv_0_zero_y: Tensor[(1), int8], %v5_conv_0_scale: Tensor[(120), float32], %v5_conv_1_weight: Tensor[(120, 1, 3, 3), int8], %v5_conv_1_bias: Tensor[(120), int32], %v5_conv_1_zero_x: Tensor[(1), int8], %v5_conv_1_zero_y: Tensor[(1), int8], %v5_conv_1_scale: Tensor[(120), float32], %v5_conv_2_weight: Tensor[(24, 120, 1, 1), int8], %v5_conv_2_bias: Tensor[(24), int32], %v5_conv_2_zero_x: Tensor[(1), int8], %v5_conv_2_zero_y: Tensor[(1), int8], %v5_conv_2_scale: Tensor[(24), float32], %v5_qadd_zero_x1: Tensor[(1), int8], %v5_qadd_zero_x2: Tensor[(1), int8], %v5_qadd_scale_x1: Tensor[(1), float32], %v5_qadd_scale_x2: Tensor[(1), float32], %v5_qadd_zero_y: Tensor[(1), int8], %v5_qadd_scale_y: Tensor[(1), float32], %v6_conv_0_weight: Tensor[(120, 24, 1, 1), int8], %v6_conv_0_bias: Tensor[(120), int32], %v6_conv_0_zero_x: Tensor[(1), int8], %v6_conv_0_zero_y: Tensor[(1), int8], %v6_conv_0_scale: Tensor[(120), float32], %v6_conv_1_weight: Tensor[(120, 1, 3, 3), int8], %v6_conv_1_bias: Tensor[(120), int32], %v6_conv_1_zero_x: Tensor[(1), int8], %v6_conv_1_zero_y: Tensor[(1), int8], %v6_conv_1_scale: Tensor[(120), float32], %v6_conv_2_weight: Tensor[(40, 120, 1, 1), int8], %v6_conv_2_bias: Tensor[(40), int32], %v6_conv_2_zero_x: Tensor[(1), int8], %v6_conv_2_zero_y: Tensor[(1), int8], %v6_conv_2_scale: Tensor[(40), float32], %v7_conv_0_weight: Tensor[(160, 40, 1, 1), int8], %v7_conv_0_bias: Tensor[(160), int32], %v7_conv_0_zero_x: Tensor[(1), int8], %v7_conv_0_zero_y: Tensor[(1), int8], %v7_conv_0_scale: Tensor[(160), float32], %v7_conv_1_weight: Tensor[(160, 1, 7, 7), int8], %v7_conv_1_bias: Tensor[(160), int32], %v7_conv_1_zero_x: Tensor[(1), int8], %v7_conv_1_zero_y: Tensor[(1), int8], %v7_conv_1_scale: Tensor[(160), float32], %v7_conv_2_weight: Tensor[(40, 160, 1, 1), int8], %v7_conv_2_bias: Tensor[(40), int32], %v7_conv_2_zero_x: Tensor[(1), int8], %v7_conv_2_zero_y: Tensor[(1), int8], %v7_conv_2_scale: Tensor[(40), float32], %v7_qadd_zero_x1: Tensor[(1), int8], %v7_qadd_zero_x2: Tensor[(1), int8], %v7_qadd_scale_x1: Tensor[(1), float32], %v7_qadd_scale_x2: Tensor[(1), float32], %v7_qadd_zero_y: Tensor[(1), int8], %v7_qadd_scale_y: Tensor[(1), float32], %v8_conv_0_weight: Tensor[(160, 40, 1, 1), int8], %v8_conv_0_bias: Tensor[(160), int32], %v8_conv_0_zero_x: Tensor[(1), int8], %v8_conv_0_zero_y: Tensor[(1), int8], %v8_conv_0_scale: Tensor[(160), float32], %v8_conv_1_weight: Tensor[(160, 1, 5, 5), int8], %v8_conv_1_bias: Tensor[(160), int32], %v8_conv_1_zero_x: Tensor[(1), int8], %v8_conv_1_zero_y: Tensor[(1), int8], %v8_conv_1_scale: Tensor[(160), float32], %v8_conv_2_weight: Tensor[(48, 160, 1, 1), int8], %v8_conv_2_bias: Tensor[(48), int32], %v8_conv_2_zero_x: Tensor[(1), int8], %v8_conv_2_zero_y: Tensor[(1), int8], %v8_conv_2_scale: Tensor[(48), float32], %v9_conv_0_weight: Tensor[(144, 48, 1, 1), int8], %v9_conv_0_bias: Tensor[(144), int32], %v9_conv_0_zero_x: Tensor[(1), int8], %v9_conv_0_zero_y: Tensor[(1), int8], %v9_conv_0_scale: Tensor[(144), float32], %v9_conv_1_weight: Tensor[(144, 1, 3, 3), int8], %v9_conv_1_bias: Tensor[(144), int32], %v9_conv_1_zero_x: Tensor[(1), int8], %v9_conv_1_zero_y: Tensor[(1), int8], %v9_conv_1_scale: Tensor[(144), float32], %v9_conv_2_weight: Tensor[(48, 144, 1, 1), int8], %v9_conv_2_bias: Tensor[(48), int32], %v9_conv_2_zero_x: Tensor[(1), int8], %v9_conv_2_zero_y: Tensor[(1), int8], %v9_conv_2_scale: Tensor[(48), float32], %v9_qadd_zero_x1: Tensor[(1), int8], %v9_qadd_zero_x2: Tensor[(1), int8], %v9_qadd_scale_x1: Tensor[(1), float32], %v9_qadd_scale_x2: Tensor[(1), float32], %v9_qadd_zero_y: Tensor[(1), int8], %v9_qadd_scale_y: Tensor[(1), float32], %v10_conv_0_weight: Tensor[(192, 48, 1, 1), int8], %v10_conv_0_bias: Tensor[(192), int32], %v10_conv_0_zero_x: Tensor[(1), int8], %v10_conv_0_zero_y: Tensor[(1), int8], %v10_conv_0_scale: Tensor[(192), float32], %v10_conv_1_weight: Tensor[(192, 1, 3, 3), int8], %v10_conv_1_bias: Tensor[(192), int32], %v10_conv_1_zero_x: Tensor[(1), int8], %v10_conv_1_zero_y: Tensor[(1), int8], %v10_conv_1_scale: Tensor[(192), float32], %v10_conv_2_weight: Tensor[(48, 192, 1, 1), int8], %v10_conv_2_bias: Tensor[(48), int32], %v10_conv_2_zero_x: Tensor[(1), int8], %v10_conv_2_zero_y: Tensor[(1), int8], %v10_conv_2_scale: Tensor[(48), float32], %v10_qadd_zero_x1: Tensor[(1), int8], %v10_qadd_zero_x2: Tensor[(1), int8], %v10_qadd_scale_x1: Tensor[(1), float32], %v10_qadd_scale_x2: Tensor[(1), float32], %v10_qadd_zero_y: Tensor[(1), int8], %v10_qadd_scale_y: Tensor[(1), float32], %v11_conv_0_weight: Tensor[(240, 48, 1, 1), int8], %v11_conv_0_bias: Tensor[(240), int32], %v11_conv_0_zero_x: Tensor[(1), int8], %v11_conv_0_zero_y: Tensor[(1), int8], %v11_conv_0_scale: Tensor[(240), float32], %v11_conv_1_weight: Tensor[(240, 1, 7, 7), int8], %v11_conv_1_bias: Tensor[(240), int32], %v11_conv_1_zero_x: Tensor[(1), int8], %v11_conv_1_zero_y: Tensor[(1), int8], %v11_conv_1_scale: Tensor[(240), float32], %v11_conv_2_weight: Tensor[(96, 240, 1, 1), int8], %v11_conv_2_bias: Tensor[(96), int32], %v11_conv_2_zero_x: Tensor[(1), int8], %v11_conv_2_zero_y: Tensor[(1), int8], %v11_conv_2_scale: Tensor[(96), float32], %v12_conv_0_weight: Tensor[(384, 96, 1, 1), int8], %v12_conv_0_bias: Tensor[(384), int32], %v12_conv_0_zero_x: Tensor[(1), int8], %v12_conv_0_zero_y: Tensor[(1), int8], %v12_conv_0_scale: Tensor[(384), float32], %v12_conv_1_weight: Tensor[(384, 1, 5, 5), int8], %v12_conv_1_bias: Tensor[(384), int32], %v12_conv_1_zero_x: Tensor[(1), int8], %v12_conv_1_zero_y: Tensor[(1), int8], %v12_conv_1_scale: Tensor[(384), float32], %v12_conv_2_weight: Tensor[(96, 384, 1, 1), int8], %v12_conv_2_bias: Tensor[(96), int32], %v12_conv_2_zero_x: Tensor[(1), int8], %v12_conv_2_zero_y: Tensor[(1), int8], %v12_conv_2_scale: Tensor[(96), float32], %v12_qadd_zero_x1: Tensor[(1), int8], %v12_qadd_zero_x2: Tensor[(1), int8], %v12_qadd_scale_x1: Tensor[(1), float32], %v12_qadd_scale_x2: Tensor[(1), float32], %v12_qadd_zero_y: Tensor[(1), int8], %v12_qadd_scale_y: Tensor[(1), float32], %v13_conv_0_weight: Tensor[(384, 96, 1, 1), int8], %v13_conv_0_bias: Tensor[(384), int32], %v13_conv_0_zero_x: Tensor[(1), int8], %v13_conv_0_zero_y: Tensor[(1), int8], %v13_conv_0_scale: Tensor[(384), float32], %v13_conv_1_weight: Tensor[(384, 1, 5, 5), int8], %v13_conv_1_bias: Tensor[(384), int32], %v13_conv_1_zero_x: Tensor[(1), int8], %v13_conv_1_zero_y: Tensor[(1), int8], %v13_conv_1_scale: Tensor[(384), float32], %v13_conv_2_weight: Tensor[(96, 384, 1, 1), int8], %v13_conv_2_bias: Tensor[(96), int32], %v13_conv_2_zero_x: Tensor[(1), int8], %v13_conv_2_zero_y: Tensor[(1), int8], %v13_conv_2_scale: Tensor[(96), float32], %v13_qadd_zero_x1: Tensor[(1), int8], %v13_qadd_zero_x2: Tensor[(1), int8], %v13_qadd_scale_x1: Tensor[(1), float32], %v13_qadd_scale_x2: Tensor[(1), float32], %v13_qadd_zero_y: Tensor[(1), int8], %v13_qadd_scale_y: Tensor[(1), float32], %v14_conv_0_weight: Tensor[(576, 96, 1, 1), int8], %v14_conv_0_bias: Tensor[(576), int32], %v14_conv_0_zero_x: Tensor[(1), int8], %v14_conv_0_zero_y: Tensor[(1), int8], %v14_conv_0_scale: Tensor[(576), float32], %v14_conv_1_weight: Tensor[(576, 1, 3, 3), int8], %v14_conv_1_bias: Tensor[(576), int32], %v14_conv_1_zero_x: Tensor[(1), int8], %v14_conv_1_zero_y: Tensor[(1), int8], %v14_conv_1_scale: Tensor[(576), float32], %v14_conv_2_weight: Tensor[(160, 576, 1, 1), int8], %v14_conv_2_bias: Tensor[(160), int32], %v14_conv_2_zero_x: Tensor[(1), int8], %v14_conv_2_zero_y: Tensor[(1), int8], %v14_conv_2_scale: Tensor[(160), float32], %v15_weight: Tensor[(10, 160, 1, 1), int8], %v15_bias: Tensor[(10), int32], %v15_zero_x: Tensor[(1), int8], %v15_zero_y: Tensor[(1), int8], %v15_scale: Tensor[(10), float32], %label: Tensor[(1, 10), float32]) -> (float32, Tensor[(10), int32], Tensor[(10, 160, 1, 1), int8], Tensor[(160), int32], Tensor[(160, 576, 1, 1), int8], Tensor[(576), int32], Tensor[(576, 1, 3, 3), int8], Tensor[(576), int32], Tensor[(576, 96, 1, 1), int8], Tensor[(96), int32], Tensor[(96, 384, 1, 1), int8], Tensor[(384), int32], Tensor[(384, 1, 5, 5), int8], Tensor[(384), int32], Tensor[(384, 96, 1, 1), int8], Tensor[(96), int32], Tensor[(96, 384, 1, 1), int8], Tensor[(384), int32], Tensor[(384, 1, 5, 5), int8], Tensor[(384), int32], Tensor[(384, 96, 1, 1), int8], Tensor[(96), int32], Tensor[(96, 240, 1, 1), int8], Tensor[(240), int32], Tensor[(240, 1, 7, 7), int8], Tensor[(240), int32], Tensor[(240, 48, 1, 1), int8], Tensor[(48), int32], Tensor[(48, 192, 1, 1), int8], Tensor[(192), int32], Tensor[(192, 1, 3, 3), int8], Tensor[(192), int32], Tensor[(192, 48, 1, 1), int8], Tensor[(48), int32], Tensor[(48, 144, 1, 1), int8], Tensor[(144), int32], Tensor[(144, 1, 3, 3), int8], Tensor[(144), int32], Tensor[(144, 48, 1, 1), int8], Tensor[(48), int32], Tensor[(48, 160, 1, 1), int8], Tensor[(160), int32], Tensor[(160, 1, 5, 5), int8], Tensor[(160), int32], Tensor[(160, 40, 1, 1), int8], Tensor[(40), int32], Tensor[(40, 160, 1, 1), int8], Tensor[(160), int32], Tensor[(160, 1, 7, 7), int8], Tensor[(160), int32], Tensor[(160, 40, 1, 1), int8], Tensor[(40), int32], Tensor[(40, 120, 1, 1), int8], Tensor[(120), int32], Tensor[(120, 1, 3, 3), int8], Tensor[(120), int32], Tensor[(120, 24, 1, 1), int8], Tensor[(24), int32], Tensor[(24, 120, 1, 1), int8], Tensor[(120), int32], Tensor[(120, 1, 3, 3), int8], Tensor[(120), int32], Tensor[(120, 24, 1, 1), int8], Tensor[(24), int32], Tensor[(24, 48, 1, 1), int8], Tensor[(48), int32], Tensor[(48, 1, 7, 7), int8], Tensor[(48), int32], Tensor[(48, 16, 1, 1), int8], Tensor[(16), int32], Tensor[(16, 48, 1, 1), int8], Tensor[(48), int32], Tensor[(48, 1, 3, 3), int8], Tensor[(48), int32], Tensor[(48, 16, 1, 1), int8], Tensor[(16), int32], Tensor[(16, 32, 1, 1), int8], Tensor[(32), int32], Tensor[(32, 1, 3, 3), int8], Tensor[(32), int32], Tensor[(32, 8, 1, 1), int8], Tensor[(8), int32], Tensor[(8, 16, 1, 1), int8], Tensor[(16), int32], Tensor[(16, 1, 3, 3), int8], Tensor[(16), int32], Tensor[(16, 3, 3, 3), int8]) {
  %0 = nn.mcuconv2d(%input, %v0_weight, %v0_bias, %v0_zero_x, %v0_zero_y, %v0_scale, strides=[2, 2], padding=[1, 1, 1, 1]) /* ty=Tensor[(1, 16, 64, 64), int32] */;
  %1 = nn.mcutruncate(%0) /* ty=Tensor[(1, 16, 64, 64), int8] */;
  %2 = nn.mcuconv2d(%1, %v1_conv_0_weight, %v1_conv_0_bias, %v1_conv_0_zero_x, %v1_conv_0_zero_y, %v1_conv_0_scale, padding=[1, 1, 1, 1], groups=16) /* ty=Tensor[(1, 16, 64, 64), int32] */;
  %3 = nn.mcutruncate(%2) /* ty=Tensor[(1, 16, 64, 64), int8] */;
  %4 = nn.mcuconv2d(%3, %v1_conv_1_weight, %v1_conv_1_bias, %v1_conv_1_zero_x, %v1_conv_1_zero_y, %v1_conv_1_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 8, 64, 64), int32] */;
  %5 = nn.mcutruncate(%4) /* ty=Tensor[(1, 8, 64, 64), int8] */;
  %6 = nn.mcuconv2d(%5, %v2_conv_0_weight, %v2_conv_0_bias, %v2_conv_0_zero_x, %v2_conv_0_zero_y, %v2_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 32, 64, 64), int32] */;
  %7 = nn.mcutruncate(%6) /* ty=Tensor[(1, 32, 64, 64), int8] */;
  %8 = nn.mcuconv2d(%7, %v2_conv_1_weight, %v2_conv_1_bias, %v2_conv_1_zero_x, %v2_conv_1_zero_y, %v2_conv_1_scale, strides=[2, 2], padding=[1, 1, 1, 1], groups=32) /* ty=Tensor[(1, 32, 32, 32), int32] */;
  %9 = nn.mcutruncate(%8) /* ty=Tensor[(1, 32, 32, 32), int8] */;
  %10 = nn.mcuconv2d(%9, %v2_conv_2_weight, %v2_conv_2_bias, %v2_conv_2_zero_x, %v2_conv_2_zero_y, %v2_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 16, 32, 32), int32] */;
  %11 = nn.mcutruncate(%10) /* ty=Tensor[(1, 16, 32, 32), int8] */;
  %12 = nn.mcuconv2d(%11, %v3_conv_0_weight, %v3_conv_0_bias, %v3_conv_0_zero_x, %v3_conv_0_zero_y, %v3_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %13 = nn.mcutruncate(%12) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %14 = nn.mcuconv2d(%13, %v3_conv_1_weight, %v3_conv_1_bias, %v3_conv_1_zero_x, %v3_conv_1_zero_y, %v3_conv_1_scale, padding=[1, 1, 1, 1], groups=48) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %15 = nn.mcutruncate(%14) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %16 = nn.mcuconv2d(%15, %v3_conv_2_weight, %v3_conv_2_bias, %v3_conv_2_zero_x, %v3_conv_2_zero_y, %v3_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 16, 32, 32), int32] */;
  %17 = nn.mcutruncate(%16) /* ty=Tensor[(1, 16, 32, 32), int8] */;
  %18 = nn.mcuadd(%11, %17, %v3_qadd_zero_x1, %v3_qadd_zero_x2, %v3_qadd_scale_x1, %v3_qadd_scale_x2, %v3_qadd_zero_y, %v3_qadd_scale_y, axis=0) /* ty=Tensor[(1, 16, 32, 32), int8] */;
  %19 = nn.mcutruncate(%18) /* ty=Tensor[(1, 16, 32, 32), int8] */;
  %20 = nn.mcuconv2d(%19, %v4_conv_0_weight, %v4_conv_0_bias, %v4_conv_0_zero_x, %v4_conv_0_zero_y, %v4_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %21 = nn.mcutruncate(%20) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %22 = nn.mcuconv2d(%21, %v4_conv_1_weight, %v4_conv_1_bias, %v4_conv_1_zero_x, %v4_conv_1_zero_y, %v4_conv_1_scale, strides=[2, 2], padding=[3, 3, 3, 3], groups=48) /* ty=Tensor[(1, 48, 16, 16), int32] */;
  %23 = nn.mcutruncate(%22) /* ty=Tensor[(1, 48, 16, 16), int8] */;
  %24 = nn.mcuconv2d(%23, %v4_conv_2_weight, %v4_conv_2_bias, %v4_conv_2_zero_x, %v4_conv_2_zero_y, %v4_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 24, 16, 16), int32] */;
  %25 = nn.mcutruncate(%24) /* ty=Tensor[(1, 24, 16, 16), int8] */;
  %26 = nn.mcuconv2d(%25, %v5_conv_0_weight, %v5_conv_0_bias, %v5_conv_0_zero_x, %v5_conv_0_zero_y, %v5_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 120, 16, 16), int32] */;
  %27 = nn.mcutruncate(%26) /* ty=Tensor[(1, 120, 16, 16), int8] */;
  %28 = nn.mcuconv2d(%27, %v5_conv_1_weight, %v5_conv_1_bias, %v5_conv_1_zero_x, %v5_conv_1_zero_y, %v5_conv_1_scale, padding=[1, 1, 1, 1], groups=120) /* ty=Tensor[(1, 120, 16, 16), int32] */;
  %29 = nn.mcutruncate(%28) /* ty=Tensor[(1, 120, 16, 16), int8] */;
  %30 = nn.mcuconv2d(%29, %v5_conv_2_weight, %v5_conv_2_bias, %v5_conv_2_zero_x, %v5_conv_2_zero_y, %v5_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 24, 16, 16), int32] */;
  %31 = nn.mcutruncate(%30) /* ty=Tensor[(1, 24, 16, 16), int8] */;
  %32 = nn.mcuadd(%25, %31, %v5_qadd_zero_x1, %v5_qadd_zero_x2, %v5_qadd_scale_x1, %v5_qadd_scale_x2, %v5_qadd_zero_y, %v5_qadd_scale_y, axis=0) /* ty=Tensor[(1, 24, 16, 16), int8] */;
  %33 = nn.mcutruncate(%32) /* ty=Tensor[(1, 24, 16, 16), int8] */;
  %34 = nn.mcuconv2d(%33, %v6_conv_0_weight, %v6_conv_0_bias, %v6_conv_0_zero_x, %v6_conv_0_zero_y, %v6_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 120, 16, 16), int32] */;
  %35 = nn.mcutruncate(%34) /* ty=Tensor[(1, 120, 16, 16), int8] */;
  %36 = nn.mcuconv2d(%35, %v6_conv_1_weight, %v6_conv_1_bias, %v6_conv_1_zero_x, %v6_conv_1_zero_y, %v6_conv_1_scale, strides=[2, 2], padding=[1, 1, 1, 1], groups=120) /* ty=Tensor[(1, 120, 8, 8), int32] */;
  %37 = nn.mcutruncate(%36) /* ty=Tensor[(1, 120, 8, 8), int8] */;
  %38 = nn.mcuconv2d(%37, %v6_conv_2_weight, %v6_conv_2_bias, %v6_conv_2_zero_x, %v6_conv_2_zero_y, %v6_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 40, 8, 8), int32] */;
  %39 = nn.mcutruncate(%38) /* ty=Tensor[(1, 40, 8, 8), int8] */;
  %40 = nn.mcuconv2d(%39, %v7_conv_0_weight, %v7_conv_0_bias, %v7_conv_0_zero_x, %v7_conv_0_zero_y, %v7_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 160, 8, 8), int32] */;
  %41 = nn.mcutruncate(%40) /* ty=Tensor[(1, 160, 8, 8), int8] */;
  %42 = nn.mcuconv2d(%41, %v7_conv_1_weight, %v7_conv_1_bias, %v7_conv_1_zero_x, %v7_conv_1_zero_y, %v7_conv_1_scale, padding=[3, 3, 3, 3], groups=160) /* ty=Tensor[(1, 160, 8, 8), int32] */;
  %43 = nn.mcutruncate(%42) /* ty=Tensor[(1, 160, 8, 8), int8] */;
  %44 = nn.mcuconv2d(%43, %v7_conv_2_weight, %v7_conv_2_bias, %v7_conv_2_zero_x, %v7_conv_2_zero_y, %v7_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 40, 8, 8), int32] */;
  %45 = nn.mcutruncate(%44) /* ty=Tensor[(1, 40, 8, 8), int8] */;
  %46 = nn.mcuadd(%39, %45, %v7_qadd_zero_x1, %v7_qadd_zero_x2, %v7_qadd_scale_x1, %v7_qadd_scale_x2, %v7_qadd_zero_y, %v7_qadd_scale_y, axis=0) /* ty=Tensor[(1, 40, 8, 8), int8] */;
  %47 = nn.mcutruncate(%46) /* ty=Tensor[(1, 40, 8, 8), int8] */;
  %48 = nn.mcuconv2d(%47, %v8_conv_0_weight, %v8_conv_0_bias, %v8_conv_0_zero_x, %v8_conv_0_zero_y, %v8_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 160, 8, 8), int32] */;
  %49 = nn.mcutruncate(%48) /* ty=Tensor[(1, 160, 8, 8), int8] */;
  %50 = nn.mcuconv2d(%49, %v8_conv_1_weight, %v8_conv_1_bias, %v8_conv_1_zero_x, %v8_conv_1_zero_y, %v8_conv_1_scale, padding=[2, 2, 2, 2], groups=160) /* ty=Tensor[(1, 160, 8, 8), int32] */;
  %51 = nn.mcutruncate(%50) /* ty=Tensor[(1, 160, 8, 8), int8] */;
  %52 = nn.mcuconv2d(%51, %v8_conv_2_weight, %v8_conv_2_bias, %v8_conv_2_zero_x, %v8_conv_2_zero_y, %v8_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %53 = nn.mcutruncate(%52) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %54 = nn.mcuconv2d(%53, %v9_conv_0_weight, %v9_conv_0_bias, %v9_conv_0_zero_x, %v9_conv_0_zero_y, %v9_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %55 = nn.mcutruncate(%54) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %56 = nn.mcuconv2d(%55, %v9_conv_1_weight, %v9_conv_1_bias, %v9_conv_1_zero_x, %v9_conv_1_zero_y, %v9_conv_1_scale, padding=[1, 1, 1, 1], groups=144) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %57 = nn.mcutruncate(%56) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %58 = nn.mcuconv2d(%57, %v9_conv_2_weight, %v9_conv_2_bias, %v9_conv_2_zero_x, %v9_conv_2_zero_y, %v9_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %59 = nn.mcutruncate(%58) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %60 = nn.mcuadd(%53, %59, %v9_qadd_zero_x1, %v9_qadd_zero_x2, %v9_qadd_scale_x1, %v9_qadd_scale_x2, %v9_qadd_zero_y, %v9_qadd_scale_y, axis=0) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %61 = nn.mcutruncate(%60) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %62 = nn.mcuconv2d(%61, %v10_conv_0_weight, %v10_conv_0_bias, %v10_conv_0_zero_x, %v10_conv_0_zero_y, %v10_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %63 = nn.mcutruncate(%62) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %64 = nn.mcuconv2d(%63, %v10_conv_1_weight, %v10_conv_1_bias, %v10_conv_1_zero_x, %v10_conv_1_zero_y, %v10_conv_1_scale, padding=[1, 1, 1, 1], groups=192) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %65 = nn.mcutruncate(%64) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %66 = nn.mcuconv2d(%65, %v10_conv_2_weight, %v10_conv_2_bias, %v10_conv_2_zero_x, %v10_conv_2_zero_y, %v10_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %67 = nn.mcutruncate(%66) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %68 = nn.mcuadd(%61, %67, %v10_qadd_zero_x1, %v10_qadd_zero_x2, %v10_qadd_scale_x1, %v10_qadd_scale_x2, %v10_qadd_zero_y, %v10_qadd_scale_y, axis=0) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %69 = nn.mcutruncate(%68) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %70 = nn.mcuconv2d(%69, %v11_conv_0_weight, %v11_conv_0_bias, %v11_conv_0_zero_x, %v11_conv_0_zero_y, %v11_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 240, 8, 8), int32] */;
  %71 = nn.mcutruncate(%70) /* ty=Tensor[(1, 240, 8, 8), int8] */;
  %72 = nn.mcuconv2d(%71, %v11_conv_1_weight, %v11_conv_1_bias, %v11_conv_1_zero_x, %v11_conv_1_zero_y, %v11_conv_1_scale, strides=[2, 2], padding=[3, 3, 3, 3], groups=240) /* ty=Tensor[(1, 240, 4, 4), int32] */;
  %73 = nn.mcutruncate(%72) /* ty=Tensor[(1, 240, 4, 4), int8] */;
  %74 = nn.mcuconv2d(%73, %v11_conv_2_weight, %v11_conv_2_bias, %v11_conv_2_zero_x, %v11_conv_2_zero_y, %v11_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %75 = nn.mcutruncate(%74) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %76 = nn.mcuconv2d(%75, %v12_conv_0_weight, %v12_conv_0_bias, %v12_conv_0_zero_x, %v12_conv_0_zero_y, %v12_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %77 = nn.mcutruncate(%76) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %78 = nn.mcuconv2d(%77, %v12_conv_1_weight, %v12_conv_1_bias, %v12_conv_1_zero_x, %v12_conv_1_zero_y, %v12_conv_1_scale, padding=[2, 2, 2, 2], groups=384) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %79 = nn.mcutruncate(%78) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %80 = nn.mcuconv2d(%79, %v12_conv_2_weight, %v12_conv_2_bias, %v12_conv_2_zero_x, %v12_conv_2_zero_y, %v12_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %81 = nn.mcutruncate(%80) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %82 = nn.mcuadd(%75, %81, %v12_qadd_zero_x1, %v12_qadd_zero_x2, %v12_qadd_scale_x1, %v12_qadd_scale_x2, %v12_qadd_zero_y, %v12_qadd_scale_y, axis=0) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %83 = nn.mcutruncate(%82) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %84 = nn.mcuconv2d(%83, %v13_conv_0_weight, %v13_conv_0_bias, %v13_conv_0_zero_x, %v13_conv_0_zero_y, %v13_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %85 = nn.mcutruncate(%84) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %86 = nn.mcuconv2d(%85, %v13_conv_1_weight, %v13_conv_1_bias, %v13_conv_1_zero_x, %v13_conv_1_zero_y, %v13_conv_1_scale, padding=[2, 2, 2, 2], groups=384) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %87 = nn.mcutruncate(%86) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %88 = nn.mcuconv2d(%87, %v13_conv_2_weight, %v13_conv_2_bias, %v13_conv_2_zero_x, %v13_conv_2_zero_y, %v13_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %89 = nn.mcutruncate(%88) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %90 = nn.mcuadd(%83, %89, %v13_qadd_zero_x1, %v13_qadd_zero_x2, %v13_qadd_scale_x1, %v13_qadd_scale_x2, %v13_qadd_zero_y, %v13_qadd_scale_y, axis=0) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %91 = nn.mcutruncate(%90) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %92 = nn.mcuconv2d(%91, %v14_conv_0_weight, %v14_conv_0_bias, %v14_conv_0_zero_x, %v14_conv_0_zero_y, %v14_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %93 = nn.mcutruncate(%92) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %94 = nn.mcuconv2d(%93, %v14_conv_1_weight, %v14_conv_1_bias, %v14_conv_1_zero_x, %v14_conv_1_zero_y, %v14_conv_1_scale, padding=[1, 1, 1, 1], groups=576) /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %95 = nn.mcutruncate(%94) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %96 = nn.mcuconv2d(%95, %v14_conv_2_weight, %v14_conv_2_bias, %v14_conv_2_zero_x, %v14_conv_2_zero_y, %v14_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 160, 4, 4), int32] */;
  %97 = nn.mcutruncate(%96) /* ty=Tensor[(1, 160, 4, 4), int8] */;
  %98 = mcumean(%97, axis=[2, 3], keepdims=True) /* ty=Tensor[(1, 160, 1, 1), int8] */;
  %99 = nn.mcuconv2d(%98, %v15_weight, %v15_bias, %v15_zero_x, %v15_zero_y, %v15_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 10, 1, 1), int32] */;
  %100 = nn.mcutruncate(%99) /* ty=Tensor[(1, 10, 1, 1), int8] */;
  %101 = reshape(%100, newshape=[0, 0]) /* ty=Tensor[(1, 10), int8] */;
  %102 = cast(%101, dtype="float32") /* ty=Tensor[(1, 10), float32] */;
  %103 = nn.log_softmax(%102) /* ty=Tensor[(1, 10), float32] */;
  %104 = greater_equal(%99, -128 /* ty=int32 */) /* ty=Tensor[(1, 10, 1, 1), bool] */;
  %105 = less_equal(%99, 127 /* ty=int32 */) /* ty=Tensor[(1, 10, 1, 1), bool] */;
  %106 = ones(shape=[], dtype="float32") /* ty=float32 */;
  %107 = negative(%106) /* ty=float32 */;
  %108 = multiply(%107, %label) /* ty=Tensor[(1, 10), float32] */;
  %109 = sum(%108, axis=[-1], keepdims=True) /* ty=Tensor[(1, 1), float32] */;
  %110 = exp(%103) /* ty=Tensor[(1, 10), float32] */;
  %111 = multiply(%109, %110) /* ty=Tensor[(1, 10), float32] */;
  %112 = subtract(%108, %111) /* ty=Tensor[(1, 10), float32] */;
  %113 = multiply(%104, %105) /* ty=Tensor[(1, 10, 1, 1), bool] */;
  %114 = reshape(%112, newshape=[1, 10, 1, 1]) /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %115 = zeros(shape=[1, 10, 1, 1], dtype="float32") /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %116 = where(%113, %114, %115) /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %117 = cast(%116, dtype="int32") /* ty=Tensor[(1, 10, 1, 1), int32] */;
  %118 = reshape(%98, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 160, 1, 1), int8] */;
  %119 = tile(%116, reps=[1, 160, 1, 1]) /* ty=Tensor[(1, 1600, 1, 1), float32] */;
  %120 = cast(%118, dtype="float32") /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %121 = reshape(%119, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(1600, 1, 1, 1), float32] */;
  %122 = nn.conv2d(%120, %121, padding=[0, 0, 0, 0], groups=160, out_dtype="float32") /* ty=Tensor[(1, 1600, 1, 1), float32] */;
  %123 = reshape(%122, newshape=[1, 160, 10, 1, 1]) /* ty=Tensor[(1, 160, 10, 1, 1), float32] */;
  %124 = sum(%123, axis=[0]) /* ty=Tensor[(160, 10, 1, 1), float32] */;
  %125 = transpose(%124, axes=[1, 0, 2, 3]) /* ty=Tensor[(10, 160, 1, 1), float32] */;
  %126 = abs(%125) /* ty=Tensor[(10, 160, 1, 1), float32] */;
  %127 = max(%126, axis=[1], keepdims=True) /* ty=Tensor[(10, 1, 1, 1), float32] */;
  %128 = divide(%127, 127f /* ty=float32 */) /* ty=Tensor[(10, 1, 1, 1), float32] */;
  %129 = divide(%125, %128) /* ty=Tensor[(10, 160, 1, 1), float32] */;
  %130 = greater_equal(%96, -128 /* ty=int32 */) /* ty=Tensor[(1, 160, 4, 4), bool] */;
  %131 = less_equal(%96, 127 /* ty=int32 */) /* ty=Tensor[(1, 160, 4, 4), bool] */;
  %132 = cast(%v15_weight, dtype="float32") /* ty=Tensor[(10, 160, 1, 1), float32] */;
  %133 = nn.conv2d_transpose(%116, %132, channels=160, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="float32") /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %134 = abs(%133) /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %135 = max(%134, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %136 = divide(%135, 127f /* ty=float32 */) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %137 = divide(%133, %136) /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %138 = cast(%137, dtype="int8") /* ty=Tensor[(1, 160, 1, 1), int8] */;
  %139 = cast(%138, dtype="float32") /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %140 = multiply(%139, 0.0625f /* ty=float32 */) /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %141 = ones(shape=[1, 160, 4, 4], dtype="float32") /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %142 = multiply(%130, %131) /* ty=Tensor[(1, 160, 4, 4), bool] */;
  %143 = multiply(%140, %141) /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %144 = zeros(shape=[1, 160, 4, 4], dtype="float32") /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %145 = where(%142, %143, %144) /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %146 = cast(%145, dtype="int32") /* ty=Tensor[(1, 160, 4, 4), int32] */;
  %147 = reshape(%95, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %148 = tile(%145, reps=[1, 576, 1, 1]) /* ty=Tensor[(1, 92160, 4, 4), float32] */;
  %149 = cast(%147, dtype="float32") /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %150 = reshape(%148, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(92160, 1, 4, 4), float32] */;
  %151 = nn.conv2d(%149, %150, padding=[0, 0, 0, 0], groups=576, out_dtype="float32") /* ty=Tensor[(1, 92160, 1, 1), float32] */;
  %152 = reshape(%151, newshape=[1, 576, 160, 1, 1]) /* ty=Tensor[(1, 576, 160, 1, 1), float32] */;
  %153 = sum(%152, axis=[0]) /* ty=Tensor[(576, 160, 1, 1), float32] */;
  %154 = transpose(%153, axes=[1, 0, 2, 3]) /* ty=Tensor[(160, 576, 1, 1), float32] */;
  %155 = abs(%154) /* ty=Tensor[(160, 576, 1, 1), float32] */;
  %156 = max(%155, axis=[1], keepdims=True) /* ty=Tensor[(160, 1, 1, 1), float32] */;
  %157 = divide(%156, 127f /* ty=float32 */) /* ty=Tensor[(160, 1, 1, 1), float32] */;
  %158 = divide(%154, %157) /* ty=Tensor[(160, 576, 1, 1), float32] */;
  %159 = greater_equal(%94, -128 /* ty=int32 */) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %160 = less_equal(%94, 127 /* ty=int32 */) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %161 = cast(%v14_conv_2_weight, dtype="float32") /* ty=Tensor[(160, 576, 1, 1), float32] */;
  %162 = nn.conv2d_transpose(%145, %161, channels=576, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="float32") /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %163 = abs(%162) /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %164 = max(%163, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), float32] */;
  %165 = divide(%164, 127f /* ty=float32 */) /* ty=Tensor[(1, 1, 4, 4), float32] */;
  %166 = divide(%162, %165) /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %167 = multiply(%159, %160) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %168 = cast(%166, dtype="int8") /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %169 = zeros(shape=[1, 576, 4, 4], dtype="int8") /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %170 = where(%167, %168, %169) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %171 = cast(%170, dtype="int32") /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %172 = tile(%170, reps=[1, 1, 1, 1]) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %173 = reshape(%93, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %174 = reshape(%172, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(576, 1, 4, 4), int8] */;
  %175 = nn.conv2d(%173, %174, padding=[1, 1, 1, 1], groups=576, out_dtype="int32") /* ty=Tensor[(1, 576, 3, 3), int32] */;
  %176 = reshape(%175, newshape=[1, 1, 576, 3, 3]) /* ty=Tensor[(1, 1, 576, 3, 3), int32] */;
  %177 = sum(%176, axis=[0]) /* ty=Tensor[(1, 576, 3, 3), int32] */;
  %178 = transpose(%177, axes=[1, 0, 2, 3]) /* ty=Tensor[(576, 1, 3, 3), int32] */;
  %179 = abs(%178) /* ty=Tensor[(576, 1, 3, 3), int32] */;
  %180 = max(%179, axis=[1], keepdims=True) /* ty=Tensor[(576, 1, 3, 3), int32] */;
  %181 = divide(%180, 127 /* ty=int32 */) /* ty=Tensor[(576, 1, 3, 3), int32] */;
  %182 = divide(%178, %181) /* ty=Tensor[(576, 1, 3, 3), int32] */;
  %183 = greater_equal(%92, -128 /* ty=int32 */) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %184 = less_equal(%92, 127 /* ty=int32 */) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %185 = nn.conv2d_transpose(%170, %v14_conv_1_weight, channels=576, kernel_size=[3, 3], padding=[1, 1, 1, 1], groups=576, kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %186 = abs(%185) /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %187 = max(%186, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %188 = divide(%187, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %189 = divide(%185, %188) /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %190 = multiply(%183, %184) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %191 = cast(%189, dtype="int8") /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %192 = zeros(shape=[1, 576, 4, 4], dtype="int8") /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %193 = where(%190, %191, %192) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %194 = cast(%193, dtype="int32") /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %195 = tile(%193, reps=[1, 96, 1, 1]) /* ty=Tensor[(1, 55296, 4, 4), int8] */;
  %196 = reshape(%91, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %197 = reshape(%195, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(55296, 1, 4, 4), int8] */;
  %198 = nn.conv2d(%196, %197, padding=[0, 0, 0, 0], groups=96, out_dtype="int32") /* ty=Tensor[(1, 55296, 1, 1), int32] */;
  %199 = reshape(%198, newshape=[1, 96, 576, 1, 1]) /* ty=Tensor[(1, 96, 576, 1, 1), int32] */;
  %200 = sum(%199, axis=[0]) /* ty=Tensor[(96, 576, 1, 1), int32] */;
  %201 = transpose(%200, axes=[1, 0, 2, 3]) /* ty=Tensor[(576, 96, 1, 1), int32] */;
  %202 = abs(%201) /* ty=Tensor[(576, 96, 1, 1), int32] */;
  %203 = max(%202, axis=[1], keepdims=True) /* ty=Tensor[(576, 1, 1, 1), int32] */;
  %204 = divide(%203, 127 /* ty=int32 */) /* ty=Tensor[(576, 1, 1, 1), int32] */;
  %205 = divide(%201, %204) /* ty=Tensor[(576, 96, 1, 1), int32] */;
  %206 = greater_equal(%88, -128 /* ty=int32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %207 = less_equal(%88, 127 /* ty=int32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %208 = greater_equal(%90, meta[relay.Constant][0] /* ty=int8 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %209 = less_equal(%90, meta[relay.Constant][1] /* ty=int8 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %210 = nn.conv2d_transpose(%193, %v14_conv_0_weight, channels=96, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %211 = abs(%210) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %212 = max(%211, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %213 = divide(%212, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %214 = divide(%210, %213) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %215 = multiply(%208, %209) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %216 = cast(%214, dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %217 = zeros(shape=[1, 96, 4, 4], dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %218 = where(%215, %216, %217) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %219 = cast(%218, dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %220 = reshape(%v13_qadd_scale_y, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %221 = divide(%219, %220) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %222 = reshape(%v13_qadd_scale_x2, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %223 = multiply(%221, %222) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %224 = multiply(%206, %207) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %225 = cast(%223, dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %226 = zeros(shape=[1, 96, 4, 4], dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %227 = where(%224, %225, %226) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %228 = cast(%227, dtype="int32") /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %229 = tile(%227, reps=[1, 384, 1, 1]) /* ty=Tensor[(1, 36864, 4, 4), int8] */;
  %230 = reshape(%87, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %231 = reshape(%229, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(36864, 1, 4, 4), int8] */;
  %232 = nn.conv2d(%230, %231, padding=[0, 0, 0, 0], groups=384, out_dtype="int32") /* ty=Tensor[(1, 36864, 1, 1), int32] */;
  %233 = reshape(%232, newshape=[1, 384, 96, 1, 1]) /* ty=Tensor[(1, 384, 96, 1, 1), int32] */;
  %234 = sum(%233, axis=[0]) /* ty=Tensor[(384, 96, 1, 1), int32] */;
  %235 = transpose(%234, axes=[1, 0, 2, 3]) /* ty=Tensor[(96, 384, 1, 1), int32] */;
  %236 = abs(%235) /* ty=Tensor[(96, 384, 1, 1), int32] */;
  %237 = max(%236, axis=[1], keepdims=True) /* ty=Tensor[(96, 1, 1, 1), int32] */;
  %238 = divide(%237, 127 /* ty=int32 */) /* ty=Tensor[(96, 1, 1, 1), int32] */;
  %239 = divide(%235, %238) /* ty=Tensor[(96, 384, 1, 1), int32] */;
  %240 = greater_equal(%86, -128 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %241 = less_equal(%86, 127 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %242 = nn.conv2d_transpose(%227, %v13_conv_2_weight, channels=384, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %243 = abs(%242) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %244 = max(%243, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %245 = divide(%244, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %246 = divide(%242, %245) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %247 = multiply(%240, %241) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %248 = cast(%246, dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %249 = zeros(shape=[1, 384, 4, 4], dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %250 = where(%247, %248, %249) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %251 = cast(%250, dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %252 = tile(%250, reps=[1, 1, 1, 1]) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %253 = reshape(%85, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %254 = reshape(%252, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(384, 1, 4, 4), int8] */;
  %255 = nn.conv2d(%253, %254, padding=[2, 2, 2, 2], groups=384, out_dtype="int32") /* ty=Tensor[(1, 384, 5, 5), int32] */;
  %256 = reshape(%255, newshape=[1, 1, 384, 5, 5]) /* ty=Tensor[(1, 1, 384, 5, 5), int32] */;
  %257 = sum(%256, axis=[0]) /* ty=Tensor[(1, 384, 5, 5), int32] */;
  %258 = transpose(%257, axes=[1, 0, 2, 3]) /* ty=Tensor[(384, 1, 5, 5), int32] */;
  %259 = abs(%258) /* ty=Tensor[(384, 1, 5, 5), int32] */;
  %260 = max(%259, axis=[1], keepdims=True) /* ty=Tensor[(384, 1, 5, 5), int32] */;
  %261 = divide(%260, 127 /* ty=int32 */) /* ty=Tensor[(384, 1, 5, 5), int32] */;
  %262 = divide(%258, %261) /* ty=Tensor[(384, 1, 5, 5), int32] */;
  %263 = greater_equal(%84, -128 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %264 = less_equal(%84, 127 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %265 = nn.conv2d_transpose(%250, %v13_conv_1_weight, channels=384, kernel_size=[5, 5], padding=[2, 2, 2, 2], groups=384, kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %266 = abs(%265) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %267 = max(%266, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %268 = divide(%267, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %269 = divide(%265, %268) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %270 = multiply(%263, %264) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %271 = cast(%269, dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %272 = zeros(shape=[1, 384, 4, 4], dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %273 = where(%270, %271, %272) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %274 = cast(%273, dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %275 = tile(%273, reps=[1, 96, 1, 1]) /* ty=Tensor[(1, 36864, 4, 4), int8] */;
  %276 = reshape(%83, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %277 = reshape(%275, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(36864, 1, 4, 4), int8] */;
  %278 = nn.conv2d(%276, %277, padding=[0, 0, 0, 0], groups=96, out_dtype="int32") /* ty=Tensor[(1, 36864, 1, 1), int32] */;
  %279 = reshape(%278, newshape=[1, 96, 384, 1, 1]) /* ty=Tensor[(1, 96, 384, 1, 1), int32] */;
  %280 = sum(%279, axis=[0]) /* ty=Tensor[(96, 384, 1, 1), int32] */;
  %281 = transpose(%280, axes=[1, 0, 2, 3]) /* ty=Tensor[(384, 96, 1, 1), int32] */;
  %282 = abs(%281) /* ty=Tensor[(384, 96, 1, 1), int32] */;
  %283 = max(%282, axis=[1], keepdims=True) /* ty=Tensor[(384, 1, 1, 1), int32] */;
  %284 = divide(%283, 127 /* ty=int32 */) /* ty=Tensor[(384, 1, 1, 1), int32] */;
  %285 = divide(%281, %284) /* ty=Tensor[(384, 96, 1, 1), int32] */;
  %286 = greater_equal(%80, -128 /* ty=int32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %287 = less_equal(%80, 127 /* ty=int32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %288 = greater_equal(%82, meta[relay.Constant][2] /* ty=int8 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %289 = less_equal(%82, meta[relay.Constant][3] /* ty=int8 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %290 = nn.conv2d_transpose(%273, %v13_conv_0_weight, channels=96, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %291 = abs(%290) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %292 = max(%291, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %293 = divide(%292, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %294 = divide(%290, %293) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %295 = multiply(%288, %289) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %296 = cast(%294, dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %297 = zeros(shape=[1, 96, 4, 4], dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %298 = where(%295, %296, %297) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %299 = cast(%298, dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %300 = reshape(%v12_qadd_scale_y, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %301 = divide(%299, %300) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %302 = reshape(%v12_qadd_scale_x2, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %303 = multiply(%301, %302) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %304 = multiply(%286, %287) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %305 = cast(%303, dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %306 = zeros(shape=[1, 96, 4, 4], dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %307 = where(%304, %305, %306) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %308 = cast(%307, dtype="int32") /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %309 = tile(%307, reps=[1, 384, 1, 1]) /* ty=Tensor[(1, 36864, 4, 4), int8] */;
  %310 = reshape(%79, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %311 = reshape(%309, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(36864, 1, 4, 4), int8] */;
  %312 = nn.conv2d(%310, %311, padding=[0, 0, 0, 0], groups=384, out_dtype="int32") /* ty=Tensor[(1, 36864, 1, 1), int32] */;
  %313 = reshape(%312, newshape=[1, 384, 96, 1, 1]) /* ty=Tensor[(1, 384, 96, 1, 1), int32] */;
  %314 = sum(%313, axis=[0]) /* ty=Tensor[(384, 96, 1, 1), int32] */;
  %315 = transpose(%314, axes=[1, 0, 2, 3]) /* ty=Tensor[(96, 384, 1, 1), int32] */;
  %316 = abs(%315) /* ty=Tensor[(96, 384, 1, 1), int32] */;
  %317 = max(%316, axis=[1], keepdims=True) /* ty=Tensor[(96, 1, 1, 1), int32] */;
  %318 = divide(%317, 127 /* ty=int32 */) /* ty=Tensor[(96, 1, 1, 1), int32] */;
  %319 = divide(%315, %318) /* ty=Tensor[(96, 384, 1, 1), int32] */;
  %320 = greater_equal(%78, -128 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %321 = less_equal(%78, 127 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %322 = nn.conv2d_transpose(%307, %v12_conv_2_weight, channels=384, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %323 = abs(%322) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %324 = max(%323, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %325 = divide(%324, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %326 = divide(%322, %325) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %327 = multiply(%320, %321) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %328 = cast(%326, dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %329 = zeros(shape=[1, 384, 4, 4], dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %330 = where(%327, %328, %329) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %331 = cast(%330, dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %332 = tile(%330, reps=[1, 1, 1, 1]) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %333 = reshape(%77, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %334 = reshape(%332, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(384, 1, 4, 4), int8] */;
  %335 = nn.conv2d(%333, %334, padding=[2, 2, 2, 2], groups=384, out_dtype="int32") /* ty=Tensor[(1, 384, 5, 5), int32] */;
  %336 = reshape(%335, newshape=[1, 1, 384, 5, 5]) /* ty=Tensor[(1, 1, 384, 5, 5), int32] */;
  %337 = sum(%336, axis=[0]) /* ty=Tensor[(1, 384, 5, 5), int32] */;
  %338 = transpose(%337, axes=[1, 0, 2, 3]) /* ty=Tensor[(384, 1, 5, 5), int32] */;
  %339 = abs(%338) /* ty=Tensor[(384, 1, 5, 5), int32] */;
  %340 = max(%339, axis=[1], keepdims=True) /* ty=Tensor[(384, 1, 5, 5), int32] */;
  %341 = divide(%340, 127 /* ty=int32 */) /* ty=Tensor[(384, 1, 5, 5), int32] */;
  %342 = divide(%338, %341) /* ty=Tensor[(384, 1, 5, 5), int32] */;
  %343 = greater_equal(%76, -128 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %344 = less_equal(%76, 127 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %345 = nn.conv2d_transpose(%330, %v12_conv_1_weight, channels=384, kernel_size=[5, 5], padding=[2, 2, 2, 2], groups=384, kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %346 = abs(%345) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %347 = max(%346, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %348 = divide(%347, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %349 = divide(%345, %348) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %350 = multiply(%343, %344) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %351 = cast(%349, dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %352 = zeros(shape=[1, 384, 4, 4], dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %353 = where(%350, %351, %352) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %354 = cast(%353, dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %355 = tile(%353, reps=[1, 96, 1, 1]) /* ty=Tensor[(1, 36864, 4, 4), int8] */;
  %356 = reshape(%75, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %357 = reshape(%355, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(36864, 1, 4, 4), int8] */;
  %358 = nn.conv2d(%356, %357, padding=[0, 0, 0, 0], groups=96, out_dtype="int32") /* ty=Tensor[(1, 36864, 1, 1), int32] */;
  %359 = reshape(%358, newshape=[1, 96, 384, 1, 1]) /* ty=Tensor[(1, 96, 384, 1, 1), int32] */;
  %360 = sum(%359, axis=[0]) /* ty=Tensor[(96, 384, 1, 1), int32] */;
  %361 = transpose(%360, axes=[1, 0, 2, 3]) /* ty=Tensor[(384, 96, 1, 1), int32] */;
  %362 = abs(%361) /* ty=Tensor[(384, 96, 1, 1), int32] */;
  %363 = max(%362, axis=[1], keepdims=True) /* ty=Tensor[(384, 1, 1, 1), int32] */;
  %364 = divide(%363, 127 /* ty=int32 */) /* ty=Tensor[(384, 1, 1, 1), int32] */;
  %365 = divide(%361, %364) /* ty=Tensor[(384, 96, 1, 1), int32] */;
  %366 = greater_equal(%74, -128 /* ty=int32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %367 = less_equal(%74, 127 /* ty=int32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %368 = nn.conv2d_transpose(%353, %v12_conv_0_weight, channels=96, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %369 = abs(%368) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %370 = max(%369, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %371 = divide(%370, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %372 = divide(%368, %371) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %373 = multiply(%366, %367) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %374 = cast(%372, dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %375 = zeros(shape=[1, 96, 4, 4], dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %376 = where(%373, %374, %375) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %377 = cast(%376, dtype="int32") /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %378 = tile(%376, reps=[1, 240, 1, 1]) /* ty=Tensor[(1, 23040, 4, 4), int8] */;
  %379 = reshape(%73, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 240, 4, 4), int8] */;
  %380 = reshape(%378, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(23040, 1, 4, 4), int8] */;
  %381 = nn.conv2d(%379, %380, padding=[0, 0, 0, 0], groups=240, out_dtype="int32") /* ty=Tensor[(1, 23040, 1, 1), int32] */;
  %382 = reshape(%381, newshape=[1, 240, 96, 1, 1]) /* ty=Tensor[(1, 240, 96, 1, 1), int32] */;
  %383 = sum(%382, axis=[0]) /* ty=Tensor[(240, 96, 1, 1), int32] */;
  %384 = transpose(%383, axes=[1, 0, 2, 3]) /* ty=Tensor[(96, 240, 1, 1), int32] */;
  %385 = abs(%384) /* ty=Tensor[(96, 240, 1, 1), int32] */;
  %386 = max(%385, axis=[1], keepdims=True) /* ty=Tensor[(96, 1, 1, 1), int32] */;
  %387 = divide(%386, 127 /* ty=int32 */) /* ty=Tensor[(96, 1, 1, 1), int32] */;
  %388 = divide(%384, %387) /* ty=Tensor[(96, 240, 1, 1), int32] */;
  %389 = greater_equal(%72, -128 /* ty=int32 */) /* ty=Tensor[(1, 240, 4, 4), bool] */;
  %390 = less_equal(%72, 127 /* ty=int32 */) /* ty=Tensor[(1, 240, 4, 4), bool] */;
