def @main(%input: Tensor[(1, 3, 128, 128), int8], %v0_weight: Tensor[(16, 3, 3, 3), int8], %v0_bias: Tensor[(16), int32], %v0_zero_x: Tensor[(1), int8], %v0_zero_y: Tensor[(1), int8], %v0_scale: Tensor[(16), float32], %v1_conv_0_weight: Tensor[(16, 1, 3, 3), int8], %v1_conv_0_bias: Tensor[(16), int32], %v1_conv_0_zero_x: Tensor[(1), int8], %v1_conv_0_zero_y: Tensor[(1), int8], %v1_conv_0_scale: Tensor[(16), float32], %v1_conv_1_weight: Tensor[(8, 16, 1, 1), int8], %v1_conv_1_bias: Tensor[(8), int32], %v1_conv_1_zero_x: Tensor[(1), int8], %v1_conv_1_zero_y: Tensor[(1), int8], %v1_conv_1_scale: Tensor[(8), float32], %v2_conv_0_weight: Tensor[(32, 8, 1, 1), int8], %v2_conv_0_bias: Tensor[(32), int32], %v2_conv_0_zero_x: Tensor[(1), int8], %v2_conv_0_zero_y: Tensor[(1), int8], %v2_conv_0_scale: Tensor[(32), float32], %v2_conv_1_weight: Tensor[(32, 1, 3, 3), int8], %v2_conv_1_bias: Tensor[(32), int32], %v2_conv_1_zero_x: Tensor[(1), int8], %v2_conv_1_zero_y: Tensor[(1), int8], %v2_conv_1_scale: Tensor[(32), float32], %v2_conv_2_weight: Tensor[(16, 32, 1, 1), int8], %v2_conv_2_bias: Tensor[(16), int32], %v2_conv_2_zero_x: Tensor[(1), int8], %v2_conv_2_zero_y: Tensor[(1), int8], %v2_conv_2_scale: Tensor[(16), float32], %v3_conv_0_weight: Tensor[(48, 16, 1, 1), int8], %v3_conv_0_bias: Tensor[(48), int32], %v3_conv_0_zero_x: Tensor[(1), int8], %v3_conv_0_zero_y: Tensor[(1), int8], %v3_conv_0_scale: Tensor[(48), float32], %v3_conv_1_weight: Tensor[(48, 1, 3, 3), int8], %v3_conv_1_bias: Tensor[(48), int32], %v3_conv_1_zero_x: Tensor[(1), int8], %v3_conv_1_zero_y: Tensor[(1), int8], %v3_conv_1_scale: Tensor[(48), float32], %v3_conv_2_weight: Tensor[(16, 48, 1, 1), int8], %v3_conv_2_bias: Tensor[(16), int32], %v3_conv_2_zero_x: Tensor[(1), int8], %v3_conv_2_zero_y: Tensor[(1), int8], %v3_conv_2_scale: Tensor[(16), float32], %v3_qadd_zero_x1: Tensor[(1), int8], %v3_qadd_zero_x2: Tensor[(1), int8], %v3_qadd_scale_x1: Tensor[(1), float32], %v3_qadd_scale_x2: Tensor[(1), float32], %v3_qadd_zero_y: Tensor[(1), int8], %v3_qadd_scale_y: Tensor[(1), float32], %v4_conv_0_weight: Tensor[(48, 16, 1, 1), int8], %v4_conv_0_bias: Tensor[(48), int32], %v4_conv_0_zero_x: Tensor[(1), int8], %v4_conv_0_zero_y: Tensor[(1), int8], %v4_conv_0_scale: Tensor[(48), float32], %v4_conv_1_weight: Tensor[(48, 1, 7, 7), int8], %v4_conv_1_bias: Tensor[(48), int32], %v4_conv_1_zero_x: Tensor[(1), int8], %v4_conv_1_zero_y: Tensor[(1), int8], %v4_conv_1_scale: Tensor[(48), float32], %v4_conv_2_weight: Tensor[(24, 48, 1, 1), int8], %v4_conv_2_bias: Tensor[(24), int32], %v4_conv_2_zero_x: Tensor[(1), int8], %v4_conv_2_zero_y: Tensor[(1), int8], %v4_conv_2_scale: Tensor[(24), float32], %v5_conv_0_weight: Tensor[(120, 24, 1, 1), int8], %v5_conv_0_bias: Tensor[(120), int32], %v5_conv_0_zero_x: Tensor[(1), int8], %v5_conv_0_zero_y: Tensor[(1), int8], %v5_conv_0_scale: Tensor[(120), float32], %v5_conv_1_weight: Tensor[(120, 1, 3, 3), int8], %v5_conv_1_bias: Tensor[(120), int32], %v5_conv_1_zero_x: Tensor[(1), int8], %v5_conv_1_zero_y: Tensor[(1), int8], %v5_conv_1_scale: Tensor[(120), float32], %v5_conv_2_weight: Tensor[(24, 120, 1, 1), int8], %v5_conv_2_bias: Tensor[(24), int32], %v5_conv_2_zero_x: Tensor[(1), int8], %v5_conv_2_zero_y: Tensor[(1), int8], %v5_conv_2_scale: Tensor[(24), float32], %v5_qadd_zero_x1: Tensor[(1), int8], %v5_qadd_zero_x2: Tensor[(1), int8], %v5_qadd_scale_x1: Tensor[(1), float32], %v5_qadd_scale_x2: Tensor[(1), float32], %v5_qadd_zero_y: Tensor[(1), int8], %v5_qadd_scale_y: Tensor[(1), float32], %v6_conv_0_weight: Tensor[(120, 24, 1, 1), int8], %v6_conv_0_bias: Tensor[(120), int32], %v6_conv_0_zero_x: Tensor[(1), int8], %v6_conv_0_zero_y: Tensor[(1), int8], %v6_conv_0_scale: Tensor[(120), float32], %v6_conv_1_weight: Tensor[(120, 1, 3, 3), int8], %v6_conv_1_bias: Tensor[(120), int32], %v6_conv_1_zero_x: Tensor[(1), int8], %v6_conv_1_zero_y: Tensor[(1), int8], %v6_conv_1_scale: Tensor[(120), float32], %v6_conv_2_weight: Tensor[(40, 120, 1, 1), int8], %v6_conv_2_bias: Tensor[(40), int32], %v6_conv_2_zero_x: Tensor[(1), int8], %v6_conv_2_zero_y: Tensor[(1), int8], %v6_conv_2_scale: Tensor[(40), float32], %v7_conv_0_weight: Tensor[(160, 40, 1, 1), int8], %v7_conv_0_bias: Tensor[(160), int32], %v7_conv_0_zero_x: Tensor[(1), int8], %v7_conv_0_zero_y: Tensor[(1), int8], %v7_conv_0_scale: Tensor[(160), float32], %v7_conv_1_weight: Tensor[(160, 1, 7, 7), int8], %v7_conv_1_bias: Tensor[(160), int32], %v7_conv_1_zero_x: Tensor[(1), int8], %v7_conv_1_zero_y: Tensor[(1), int8], %v7_conv_1_scale: Tensor[(160), float32], %v7_conv_2_weight: Tensor[(40, 160, 1, 1), int8], %v7_conv_2_bias: Tensor[(40), int32], %v7_conv_2_zero_x: Tensor[(1), int8], %v7_conv_2_zero_y: Tensor[(1), int8], %v7_conv_2_scale: Tensor[(40), float32], %v7_qadd_zero_x1: Tensor[(1), int8], %v7_qadd_zero_x2: Tensor[(1), int8], %v7_qadd_scale_x1: Tensor[(1), float32], %v7_qadd_scale_x2: Tensor[(1), float32], %v7_qadd_zero_y: Tensor[(1), int8], %v7_qadd_scale_y: Tensor[(1), float32], %v8_conv_0_weight: Tensor[(160, 40, 1, 1), int8], %v8_conv_0_bias: Tensor[(160), int32], %v8_conv_0_zero_x: Tensor[(1), int8], %v8_conv_0_zero_y: Tensor[(1), int8], %v8_conv_0_scale: Tensor[(160), float32], %v8_conv_1_weight: Tensor[(160, 1, 5, 5), int8], %v8_conv_1_bias: Tensor[(160), int32], %v8_conv_1_zero_x: Tensor[(1), int8], %v8_conv_1_zero_y: Tensor[(1), int8], %v8_conv_1_scale: Tensor[(160), float32], %v8_conv_2_weight: Tensor[(48, 160, 1, 1), int8], %v8_conv_2_bias: Tensor[(48), int32], %v8_conv_2_zero_x: Tensor[(1), int8], %v8_conv_2_zero_y: Tensor[(1), int8], %v8_conv_2_scale: Tensor[(48), float32], %v9_conv_0_weight: Tensor[(144, 48, 1, 1), int8], %v9_conv_0_bias: Tensor[(144), int32], %v9_conv_0_zero_x: Tensor[(1), int8], %v9_conv_0_zero_y: Tensor[(1), int8], %v9_conv_0_scale: Tensor[(144), float32], %v9_conv_1_weight: Tensor[(144, 1, 3, 3), int8], %v9_conv_1_bias: Tensor[(144), int32], %v9_conv_1_zero_x: Tensor[(1), int8], %v9_conv_1_zero_y: Tensor[(1), int8], %v9_conv_1_scale: Tensor[(144), float32], %v9_conv_2_weight: Tensor[(48, 144, 1, 1), int8], %v9_conv_2_bias: Tensor[(48), int32], %v9_conv_2_zero_x: Tensor[(1), int8], %v9_conv_2_zero_y: Tensor[(1), int8], %v9_conv_2_scale: Tensor[(48), float32], %v9_qadd_zero_x1: Tensor[(1), int8], %v9_qadd_zero_x2: Tensor[(1), int8], %v9_qadd_scale_x1: Tensor[(1), float32], %v9_qadd_scale_x2: Tensor[(1), float32], %v9_qadd_zero_y: Tensor[(1), int8], %v9_qadd_scale_y: Tensor[(1), float32], %v10_conv_0_weight: Tensor[(192, 48, 1, 1), int8], %v10_conv_0_bias: Tensor[(192), int32], %v10_conv_0_zero_x: Tensor[(1), int8], %v10_conv_0_zero_y: Tensor[(1), int8], %v10_conv_0_scale: Tensor[(192), float32], %v10_conv_1_weight: Tensor[(192, 1, 3, 3), int8], %v10_conv_1_bias: Tensor[(192), int32], %v10_conv_1_zero_x: Tensor[(1), int8], %v10_conv_1_zero_y: Tensor[(1), int8], %v10_conv_1_scale: Tensor[(192), float32], %v10_conv_2_weight: Tensor[(48, 192, 1, 1), int8], %v10_conv_2_bias: Tensor[(48), int32], %v10_conv_2_zero_x: Tensor[(1), int8], %v10_conv_2_zero_y: Tensor[(1), int8], %v10_conv_2_scale: Tensor[(48), float32], %v10_qadd_zero_x1: Tensor[(1), int8], %v10_qadd_zero_x2: Tensor[(1), int8], %v10_qadd_scale_x1: Tensor[(1), float32], %v10_qadd_scale_x2: Tensor[(1), float32], %v10_qadd_zero_y: Tensor[(1), int8], %v10_qadd_scale_y: Tensor[(1), float32], %v11_conv_0_weight: Tensor[(240, 48, 1, 1), int8], %v11_conv_0_bias: Tensor[(240), int32], %v11_conv_0_zero_x: Tensor[(1), int8], %v11_conv_0_zero_y: Tensor[(1), int8], %v11_conv_0_scale: Tensor[(240), float32], %v11_conv_1_weight: Tensor[(240, 1, 7, 7), int8], %v11_conv_1_bias: Tensor[(240), int32], %v11_conv_1_zero_x: Tensor[(1), int8], %v11_conv_1_zero_y: Tensor[(1), int8], %v11_conv_1_scale: Tensor[(240), float32], %v11_conv_2_weight: Tensor[(96, 240, 1, 1), int8], %v11_conv_2_bias: Tensor[(96), int32], %v11_conv_2_zero_x: Tensor[(1), int8], %v11_conv_2_zero_y: Tensor[(1), int8], %v11_conv_2_scale: Tensor[(96), float32], %v12_conv_0_weight: Tensor[(384, 96, 1, 1), int8], %v12_conv_0_bias: Tensor[(384), int32], %v12_conv_0_zero_x: Tensor[(1), int8], %v12_conv_0_zero_y: Tensor[(1), int8], %v12_conv_0_scale: Tensor[(384), float32], %v12_conv_1_weight: Tensor[(384, 1, 5, 5), int8], %v12_conv_1_bias: Tensor[(384), int32], %v12_conv_1_zero_x: Tensor[(1), int8], %v12_conv_1_zero_y: Tensor[(1), int8], %v12_conv_1_scale: Tensor[(384), float32], %v12_conv_2_weight: Tensor[(96, 384, 1, 1), int8], %v12_conv_2_bias: Tensor[(96), int32], %v12_conv_2_zero_x: Tensor[(1), int8], %v12_conv_2_zero_y: Tensor[(1), int8], %v12_conv_2_scale: Tensor[(96), float32], %v12_qadd_zero_x1: Tensor[(1), int8], %v12_qadd_zero_x2: Tensor[(1), int8], %v12_qadd_scale_x1: Tensor[(1), float32], %v12_qadd_scale_x2: Tensor[(1), float32], %v12_qadd_zero_y: Tensor[(1), int8], %v12_qadd_scale_y: Tensor[(1), float32], %v13_conv_0_weight: Tensor[(384, 96, 1, 1), int8], %v13_conv_0_bias: Tensor[(384), int32], %v13_conv_0_zero_x: Tensor[(1), int8], %v13_conv_0_zero_y: Tensor[(1), int8], %v13_conv_0_scale: Tensor[(384), float32], %v13_conv_1_weight: Tensor[(384, 1, 5, 5), int8], %v13_conv_1_bias: Tensor[(384), int32], %v13_conv_1_zero_x: Tensor[(1), int8], %v13_conv_1_zero_y: Tensor[(1), int8], %v13_conv_1_scale: Tensor[(384), float32], %v13_conv_2_weight: Tensor[(96, 384, 1, 1), int8], %v13_conv_2_bias: Tensor[(96), int32], %v13_conv_2_zero_x: Tensor[(1), int8], %v13_conv_2_zero_y: Tensor[(1), int8], %v13_conv_2_scale: Tensor[(96), float32], %v13_qadd_zero_x1: Tensor[(1), int8], %v13_qadd_zero_x2: Tensor[(1), int8], %v13_qadd_scale_x1: Tensor[(1), float32], %v13_qadd_scale_x2: Tensor[(1), float32], %v13_qadd_zero_y: Tensor[(1), int8], %v13_qadd_scale_y: Tensor[(1), float32], %v14_conv_0_weight: Tensor[(576, 96, 1, 1), int8], %v14_conv_0_bias: Tensor[(576), int32], %v14_conv_0_zero_x: Tensor[(1), int8], %v14_conv_0_zero_y: Tensor[(1), int8], %v14_conv_0_scale: Tensor[(576), float32], %v14_conv_1_weight: Tensor[(576, 1, 3, 3), int8], %v14_conv_1_bias: Tensor[(576), int32], %v14_conv_1_zero_x: Tensor[(1), int8], %v14_conv_1_zero_y: Tensor[(1), int8], %v14_conv_1_scale: Tensor[(576), float32], %v14_conv_2_weight: Tensor[(160, 576, 1, 1), int8], %v14_conv_2_bias: Tensor[(160), int32], %v14_conv_2_zero_x: Tensor[(1), int8], %v14_conv_2_zero_y: Tensor[(1), int8], %v14_conv_2_scale: Tensor[(160), float32], %v15_weight: Tensor[(10, 160, 1, 1), int8], %v15_bias: Tensor[(10), int32], %v15_zero_x: Tensor[(1), int8], %v15_zero_y: Tensor[(1), int8], %v15_scale: Tensor[(10), float32], %label: Tensor[(1, 10), float32]) -> (float32, Tensor[(10), float32], Tensor[(10, 160, 1, 1), float32], Tensor[(160), float32], Tensor[(160, 576, 1, 1), float32], Tensor[(576), float32], Tensor[(576, 1, 3, 3), float32], Tensor[(576), float32], Tensor[(576, 96, 1, 1), float32], Tensor[(96), float32], Tensor[(96, 384, 1, 1), float32], Tensor[(384), float32], Tensor[(384, 1, 5, 5), float32], Tensor[(384), float32], Tensor[(384, 96, 1, 1), float32], Tensor[(96), float32], Tensor[(96, 384, 1, 1), float32], Tensor[(384), float32], Tensor[(384, 1, 5, 5), float32], Tensor[(384), float32], Tensor[(384, 96, 1, 1), float32], Tensor[(96), float32], Tensor[(96, 240, 1, 1), float32], Tensor[(240), float32], Tensor[(240, 1, 7, 7), float32], Tensor[(240), float32], Tensor[(240, 48, 1, 1), float32], Tensor[(48), float32], Tensor[(48, 192, 1, 1), float32], Tensor[(192), float32], Tensor[(192, 1, 3, 3), float32], Tensor[(192), float32], Tensor[(192, 48, 1, 1), float32], Tensor[(48), float32], Tensor[(48, 144, 1, 1), float32], Tensor[(144), float32], Tensor[(144, 1, 3, 3), float32], Tensor[(144), float32], Tensor[(144, 48, 1, 1), float32], Tensor[(48), float32], Tensor[(48, 160, 1, 1), float32], Tensor[(160), float32], Tensor[(160, 1, 5, 5), float32], Tensor[(160), float32], Tensor[(160, 40, 1, 1), float32], Tensor[(40), float32], Tensor[(40, 160, 1, 1), float32], Tensor[(160), float32], Tensor[(160, 1, 7, 7), float32], Tensor[(160), float32], Tensor[(160, 40, 1, 1), float32], Tensor[(40), float32], Tensor[(40, 120, 1, 1), float32], Tensor[(120), float32], Tensor[(120, 1, 3, 3), float32], Tensor[(120), float32], Tensor[(120, 24, 1, 1), float32], Tensor[(24), float32], Tensor[(24, 120, 1, 1), float32], Tensor[(120), float32], Tensor[(120, 1, 3, 3), float32], Tensor[(120), float32], Tensor[(120, 24, 1, 1), float32], Tensor[(24), float32], Tensor[(24, 48, 1, 1), float32], Tensor[(48), float32], Tensor[(48, 1, 7, 7), float32], Tensor[(48), float32], Tensor[(48, 16, 1, 1), float32], Tensor[(16), float32], Tensor[(16, 48, 1, 1), float32], Tensor[(48), float32], Tensor[(48, 1, 3, 3), float32], Tensor[(48), float32], Tensor[(48, 16, 1, 1), float32], Tensor[(16), float32], Tensor[(16, 32, 1, 1), float32], Tensor[(32), float32], Tensor[(32, 1, 3, 3), float32], Tensor[(32), float32], Tensor[(32, 8, 1, 1), float32], Tensor[(8), float32], Tensor[(8, 16, 1, 1), float32], Tensor[(16), float32], Tensor[(16, 1, 3, 3), float32], Tensor[(16), float32], Tensor[(16, 3, 3, 3), float32]) {
  %0 = nn.mcuconv2d(%input, %v0_weight, %v0_bias, %v0_zero_x, %v0_zero_y, %v0_scale, strides=[2, 2], padding=[1, 1, 1, 1]) /* ty=Tensor[(1, 16, 64, 64), int32] */;
  %1 = nn.mcutruncate(%0) /* ty=Tensor[(1, 16, 64, 64), int8] */;
  %2 = nn.mcuconv2d(%1, %v1_conv_0_weight, %v1_conv_0_bias, %v1_conv_0_zero_x, %v1_conv_0_zero_y, %v1_conv_0_scale, padding=[1, 1, 1, 1], groups=16) /* ty=Tensor[(1, 16, 64, 64), int32] */;
  %3 = nn.mcutruncate(%2) /* ty=Tensor[(1, 16, 64, 64), int8] */;
  %4 = nn.mcuconv2d(%3, %v1_conv_1_weight, %v1_conv_1_bias, %v1_conv_1_zero_x, %v1_conv_1_zero_y, %v1_conv_1_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 8, 64, 64), int32] */;
  %5 = nn.mcutruncate(%4) /* ty=Tensor[(1, 8, 64, 64), int8] */;
  %6 = nn.mcuconv2d(%5, %v2_conv_0_weight, %v2_conv_0_bias, %v2_conv_0_zero_x, %v2_conv_0_zero_y, %v2_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 32, 64, 64), int32] */;
  %7 = nn.mcutruncate(%6) /* ty=Tensor[(1, 32, 64, 64), int8] */;
  %8 = nn.mcuconv2d(%7, %v2_conv_1_weight, %v2_conv_1_bias, %v2_conv_1_zero_x, %v2_conv_1_zero_y, %v2_conv_1_scale, strides=[2, 2], padding=[1, 1, 1, 1], groups=32) /* ty=Tensor[(1, 32, 32, 32), int32] */;
  %9 = nn.mcutruncate(%8) /* ty=Tensor[(1, 32, 32, 32), int8] */;
  %10 = nn.mcuconv2d(%9, %v2_conv_2_weight, %v2_conv_2_bias, %v2_conv_2_zero_x, %v2_conv_2_zero_y, %v2_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 16, 32, 32), int32] */;
  %11 = nn.mcutruncate(%10) /* ty=Tensor[(1, 16, 32, 32), int8] */;
  %12 = nn.mcuconv2d(%11, %v3_conv_0_weight, %v3_conv_0_bias, %v3_conv_0_zero_x, %v3_conv_0_zero_y, %v3_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %13 = nn.mcutruncate(%12) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %14 = nn.mcuconv2d(%13, %v3_conv_1_weight, %v3_conv_1_bias, %v3_conv_1_zero_x, %v3_conv_1_zero_y, %v3_conv_1_scale, padding=[1, 1, 1, 1], groups=48) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %15 = nn.mcutruncate(%14) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %16 = nn.mcuconv2d(%15, %v3_conv_2_weight, %v3_conv_2_bias, %v3_conv_2_zero_x, %v3_conv_2_zero_y, %v3_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 16, 32, 32), int32] */;
  %17 = nn.mcutruncate(%16) /* ty=Tensor[(1, 16, 32, 32), int8] */;
  %18 = nn.mcuadd(%11, %17, %v3_qadd_zero_x1, %v3_qadd_zero_x2, %v3_qadd_scale_x1, %v3_qadd_scale_x2, %v3_qadd_zero_y, %v3_qadd_scale_y, axis=0) /* ty=Tensor[(1, 16, 32, 32), int8] */;
  %19 = nn.mcutruncate(%18) /* ty=Tensor[(1, 16, 32, 32), int8] */;
  %20 = nn.mcuconv2d(%19, %v4_conv_0_weight, %v4_conv_0_bias, %v4_conv_0_zero_x, %v4_conv_0_zero_y, %v4_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %21 = nn.mcutruncate(%20) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %22 = nn.mcuconv2d(%21, %v4_conv_1_weight, %v4_conv_1_bias, %v4_conv_1_zero_x, %v4_conv_1_zero_y, %v4_conv_1_scale, strides=[2, 2], padding=[3, 3, 3, 3], groups=48) /* ty=Tensor[(1, 48, 16, 16), int32] */;
  %23 = nn.mcutruncate(%22) /* ty=Tensor[(1, 48, 16, 16), int8] */;
  %24 = nn.mcuconv2d(%23, %v4_conv_2_weight, %v4_conv_2_bias, %v4_conv_2_zero_x, %v4_conv_2_zero_y, %v4_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 24, 16, 16), int32] */;
  %25 = nn.mcutruncate(%24) /* ty=Tensor[(1, 24, 16, 16), int8] */;
  %26 = nn.mcuconv2d(%25, %v5_conv_0_weight, %v5_conv_0_bias, %v5_conv_0_zero_x, %v5_conv_0_zero_y, %v5_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 120, 16, 16), int32] */;
  %27 = nn.mcutruncate(%26) /* ty=Tensor[(1, 120, 16, 16), int8] */;
  %28 = nn.mcuconv2d(%27, %v5_conv_1_weight, %v5_conv_1_bias, %v5_conv_1_zero_x, %v5_conv_1_zero_y, %v5_conv_1_scale, padding=[1, 1, 1, 1], groups=120) /* ty=Tensor[(1, 120, 16, 16), int32] */;
  %29 = nn.mcutruncate(%28) /* ty=Tensor[(1, 120, 16, 16), int8] */;
  %30 = nn.mcuconv2d(%29, %v5_conv_2_weight, %v5_conv_2_bias, %v5_conv_2_zero_x, %v5_conv_2_zero_y, %v5_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 24, 16, 16), int32] */;
  %31 = nn.mcutruncate(%30) /* ty=Tensor[(1, 24, 16, 16), int8] */;
  %32 = nn.mcuadd(%25, %31, %v5_qadd_zero_x1, %v5_qadd_zero_x2, %v5_qadd_scale_x1, %v5_qadd_scale_x2, %v5_qadd_zero_y, %v5_qadd_scale_y, axis=0) /* ty=Tensor[(1, 24, 16, 16), int8] */;
  %33 = nn.mcutruncate(%32) /* ty=Tensor[(1, 24, 16, 16), int8] */;
  %34 = nn.mcuconv2d(%33, %v6_conv_0_weight, %v6_conv_0_bias, %v6_conv_0_zero_x, %v6_conv_0_zero_y, %v6_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 120, 16, 16), int32] */;
  %35 = nn.mcutruncate(%34) /* ty=Tensor[(1, 120, 16, 16), int8] */;
  %36 = nn.mcuconv2d(%35, %v6_conv_1_weight, %v6_conv_1_bias, %v6_conv_1_zero_x, %v6_conv_1_zero_y, %v6_conv_1_scale, strides=[2, 2], padding=[1, 1, 1, 1], groups=120) /* ty=Tensor[(1, 120, 8, 8), int32] */;
  %37 = nn.mcutruncate(%36) /* ty=Tensor[(1, 120, 8, 8), int8] */;
  %38 = nn.mcuconv2d(%37, %v6_conv_2_weight, %v6_conv_2_bias, %v6_conv_2_zero_x, %v6_conv_2_zero_y, %v6_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 40, 8, 8), int32] */;
  %39 = nn.mcutruncate(%38) /* ty=Tensor[(1, 40, 8, 8), int8] */;
  %40 = nn.mcuconv2d(%39, %v7_conv_0_weight, %v7_conv_0_bias, %v7_conv_0_zero_x, %v7_conv_0_zero_y, %v7_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 160, 8, 8), int32] */;
  %41 = nn.mcutruncate(%40) /* ty=Tensor[(1, 160, 8, 8), int8] */;
  %42 = nn.mcuconv2d(%41, %v7_conv_1_weight, %v7_conv_1_bias, %v7_conv_1_zero_x, %v7_conv_1_zero_y, %v7_conv_1_scale, padding=[3, 3, 3, 3], groups=160) /* ty=Tensor[(1, 160, 8, 8), int32] */;
  %43 = nn.mcutruncate(%42) /* ty=Tensor[(1, 160, 8, 8), int8] */;
  %44 = nn.mcuconv2d(%43, %v7_conv_2_weight, %v7_conv_2_bias, %v7_conv_2_zero_x, %v7_conv_2_zero_y, %v7_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 40, 8, 8), int32] */;
  %45 = nn.mcutruncate(%44) /* ty=Tensor[(1, 40, 8, 8), int8] */;
  %46 = nn.mcuadd(%39, %45, %v7_qadd_zero_x1, %v7_qadd_zero_x2, %v7_qadd_scale_x1, %v7_qadd_scale_x2, %v7_qadd_zero_y, %v7_qadd_scale_y, axis=0) /* ty=Tensor[(1, 40, 8, 8), int8] */;
  %47 = nn.mcutruncate(%46) /* ty=Tensor[(1, 40, 8, 8), int8] */;
  %48 = nn.mcuconv2d(%47, %v8_conv_0_weight, %v8_conv_0_bias, %v8_conv_0_zero_x, %v8_conv_0_zero_y, %v8_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 160, 8, 8), int32] */;
  %49 = nn.mcutruncate(%48) /* ty=Tensor[(1, 160, 8, 8), int8] */;
  %50 = nn.mcuconv2d(%49, %v8_conv_1_weight, %v8_conv_1_bias, %v8_conv_1_zero_x, %v8_conv_1_zero_y, %v8_conv_1_scale, padding=[2, 2, 2, 2], groups=160) /* ty=Tensor[(1, 160, 8, 8), int32] */;
  %51 = nn.mcutruncate(%50) /* ty=Tensor[(1, 160, 8, 8), int8] */;
  %52 = nn.mcuconv2d(%51, %v8_conv_2_weight, %v8_conv_2_bias, %v8_conv_2_zero_x, %v8_conv_2_zero_y, %v8_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %53 = nn.mcutruncate(%52) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %54 = nn.mcuconv2d(%53, %v9_conv_0_weight, %v9_conv_0_bias, %v9_conv_0_zero_x, %v9_conv_0_zero_y, %v9_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %55 = nn.mcutruncate(%54) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %56 = nn.mcuconv2d(%55, %v9_conv_1_weight, %v9_conv_1_bias, %v9_conv_1_zero_x, %v9_conv_1_zero_y, %v9_conv_1_scale, padding=[1, 1, 1, 1], groups=144) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %57 = nn.mcutruncate(%56) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %58 = nn.mcuconv2d(%57, %v9_conv_2_weight, %v9_conv_2_bias, %v9_conv_2_zero_x, %v9_conv_2_zero_y, %v9_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %59 = nn.mcutruncate(%58) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %60 = nn.mcuadd(%53, %59, %v9_qadd_zero_x1, %v9_qadd_zero_x2, %v9_qadd_scale_x1, %v9_qadd_scale_x2, %v9_qadd_zero_y, %v9_qadd_scale_y, axis=0) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %61 = nn.mcutruncate(%60) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %62 = nn.mcuconv2d(%61, %v10_conv_0_weight, %v10_conv_0_bias, %v10_conv_0_zero_x, %v10_conv_0_zero_y, %v10_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %63 = nn.mcutruncate(%62) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %64 = nn.mcuconv2d(%63, %v10_conv_1_weight, %v10_conv_1_bias, %v10_conv_1_zero_x, %v10_conv_1_zero_y, %v10_conv_1_scale, padding=[1, 1, 1, 1], groups=192) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %65 = nn.mcutruncate(%64) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %66 = nn.mcuconv2d(%65, %v10_conv_2_weight, %v10_conv_2_bias, %v10_conv_2_zero_x, %v10_conv_2_zero_y, %v10_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %67 = nn.mcutruncate(%66) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %68 = nn.mcuadd(%61, %67, %v10_qadd_zero_x1, %v10_qadd_zero_x2, %v10_qadd_scale_x1, %v10_qadd_scale_x2, %v10_qadd_zero_y, %v10_qadd_scale_y, axis=0) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %69 = nn.mcutruncate(%68) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %70 = nn.mcuconv2d(%69, %v11_conv_0_weight, %v11_conv_0_bias, %v11_conv_0_zero_x, %v11_conv_0_zero_y, %v11_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 240, 8, 8), int32] */;
  %71 = nn.mcutruncate(%70) /* ty=Tensor[(1, 240, 8, 8), int8] */;
  %72 = nn.mcuconv2d(%71, %v11_conv_1_weight, %v11_conv_1_bias, %v11_conv_1_zero_x, %v11_conv_1_zero_y, %v11_conv_1_scale, strides=[2, 2], padding=[3, 3, 3, 3], groups=240) /* ty=Tensor[(1, 240, 4, 4), int32] */;
  %73 = nn.mcutruncate(%72) /* ty=Tensor[(1, 240, 4, 4), int8] */;
  %74 = nn.mcuconv2d(%73, %v11_conv_2_weight, %v11_conv_2_bias, %v11_conv_2_zero_x, %v11_conv_2_zero_y, %v11_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %75 = nn.mcutruncate(%74) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %76 = nn.mcuconv2d(%75, %v12_conv_0_weight, %v12_conv_0_bias, %v12_conv_0_zero_x, %v12_conv_0_zero_y, %v12_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %77 = nn.mcutruncate(%76) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %78 = nn.mcuconv2d(%77, %v12_conv_1_weight, %v12_conv_1_bias, %v12_conv_1_zero_x, %v12_conv_1_zero_y, %v12_conv_1_scale, padding=[2, 2, 2, 2], groups=384) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %79 = nn.mcutruncate(%78) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %80 = nn.mcuconv2d(%79, %v12_conv_2_weight, %v12_conv_2_bias, %v12_conv_2_zero_x, %v12_conv_2_zero_y, %v12_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %81 = nn.mcutruncate(%80) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %82 = nn.mcuadd(%75, %81, %v12_qadd_zero_x1, %v12_qadd_zero_x2, %v12_qadd_scale_x1, %v12_qadd_scale_x2, %v12_qadd_zero_y, %v12_qadd_scale_y, axis=0) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %83 = nn.mcutruncate(%82) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %84 = nn.mcuconv2d(%83, %v13_conv_0_weight, %v13_conv_0_bias, %v13_conv_0_zero_x, %v13_conv_0_zero_y, %v13_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %85 = nn.mcutruncate(%84) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %86 = nn.mcuconv2d(%85, %v13_conv_1_weight, %v13_conv_1_bias, %v13_conv_1_zero_x, %v13_conv_1_zero_y, %v13_conv_1_scale, padding=[2, 2, 2, 2], groups=384) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %87 = nn.mcutruncate(%86) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %88 = nn.mcuconv2d(%87, %v13_conv_2_weight, %v13_conv_2_bias, %v13_conv_2_zero_x, %v13_conv_2_zero_y, %v13_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %89 = nn.mcutruncate(%88) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %90 = nn.mcuadd(%83, %89, %v13_qadd_zero_x1, %v13_qadd_zero_x2, %v13_qadd_scale_x1, %v13_qadd_scale_x2, %v13_qadd_zero_y, %v13_qadd_scale_y, axis=0) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %91 = nn.mcutruncate(%90) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %92 = nn.mcuconv2d(%91, %v14_conv_0_weight, %v14_conv_0_bias, %v14_conv_0_zero_x, %v14_conv_0_zero_y, %v14_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %93 = nn.mcutruncate(%92) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %94 = nn.mcuconv2d(%93, %v14_conv_1_weight, %v14_conv_1_bias, %v14_conv_1_zero_x, %v14_conv_1_zero_y, %v14_conv_1_scale, padding=[1, 1, 1, 1], groups=576) /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %95 = nn.mcutruncate(%94) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %96 = nn.mcuconv2d(%95, %v14_conv_2_weight, %v14_conv_2_bias, %v14_conv_2_zero_x, %v14_conv_2_zero_y, %v14_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 160, 4, 4), int32] */;
  %97 = nn.mcutruncate(%96) /* ty=Tensor[(1, 160, 4, 4), int8] */;
  %98 = mcumean(%97, axis=[2, 3], keepdims=True) /* ty=Tensor[(1, 160, 1, 1), int8] */;
  %99 = nn.mcuconv2d(%98, %v15_weight, %v15_bias, %v15_zero_x, %v15_zero_y, %v15_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 10, 1, 1), int32] */;
  %100 = nn.mcutruncate(%99) /* ty=Tensor[(1, 10, 1, 1), int8] */;
  %101 = reshape(%100, newshape=[0, 0]) /* ty=Tensor[(1, 10), int8] */;
  %102 = cast(%101, dtype="float32") /* ty=Tensor[(1, 10), float32] */;
  %103 = nn.log_softmax(%102) /* ty=Tensor[(1, 10), float32] */;
  %104 = cast(%99, dtype="float32") /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %105 = greater_equal(%104, -128f /* ty=float32 */) /* ty=Tensor[(1, 10, 1, 1), bool] */;
  %106 = less_equal(%104, 127f /* ty=float32 */) /* ty=Tensor[(1, 10, 1, 1), bool] */;
  %107 = ones(shape=[], dtype="float32") /* ty=float32 */;
  %108 = negative(%107) /* ty=float32 */;
  %109 = multiply(%108, %label) /* ty=Tensor[(1, 10), float32] */;
  %110 = sum(%109, axis=[-1], keepdims=True) /* ty=Tensor[(1, 1), float32] */;
  %111 = exp(%103) /* ty=Tensor[(1, 10), float32] */;
  %112 = multiply(%110, %111) /* ty=Tensor[(1, 10), float32] */;
  %113 = subtract(%109, %112) /* ty=Tensor[(1, 10), float32] */;
  %114 = multiply(%105, %106) /* ty=Tensor[(1, 10, 1, 1), bool] */;
  %115 = reshape(%113, newshape=[1, 10, 1, 1]) /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %116 = zeros(shape=[1, 10, 1, 1], dtype="float32") /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %117 = where(%114, %115, %116) /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %118 = reshape(%v15_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %119 = multiply(%117, %118) /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %120 = cast(%98, dtype="float32") /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %121 = tile(%119, reps=[1, 160, 1, 1]) /* ty=Tensor[(1, 1600, 1, 1), float32] */;
  %122 = reshape(%120, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %123 = reshape(%121, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(1600, 1, 1, 1), float32] */;
  %124 = nn.conv2d(%122, %123, padding=[0, 0, 0, 0], groups=160) /* ty=Tensor[(1, 1600, 1, 1), float32] */;
  %125 = reshape(%124, newshape=[1, 160, 10, 1, 1]) /* ty=Tensor[(1, 160, 10, 1, 1), float32] */;
  %126 = sum(%125, axis=[0]) /* ty=Tensor[(160, 10, 1, 1), float32] */;
  %127 = cast(%96, dtype="float32") /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %128 = greater_equal(%127, -128f /* ty=float32 */) /* ty=Tensor[(1, 160, 4, 4), bool] */;
  %129 = less_equal(%127, 127f /* ty=float32 */) /* ty=Tensor[(1, 160, 4, 4), bool] */;
  %130 = cast(%v15_weight, dtype="float32") /* ty=Tensor[(10, 160, 1, 1), float32] */;
  %131 = nn.conv2d_transpose(%119, %130, channels=160, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %132 = multiply(%131, 0.0625f /* ty=float32 */) /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %133 = ones(shape=[1, 160, 4, 4], dtype="float32") /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %134 = multiply(%128, %129) /* ty=Tensor[(1, 160, 4, 4), bool] */;
  %135 = multiply(%132, %133) /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %136 = zeros(shape=[1, 160, 4, 4], dtype="float32") /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %137 = where(%134, %135, %136) /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %138 = reshape(%v14_conv_2_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %139 = multiply(%137, %138) /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %140 = cast(%95, dtype="float32") /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %141 = tile(%139, reps=[1, 576, 1, 1]) /* ty=Tensor[(1, 92160, 4, 4), float32] */;
  %142 = reshape(%140, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %143 = reshape(%141, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(92160, 1, 4, 4), float32] */;
  %144 = nn.conv2d(%142, %143, padding=[0, 0, 0, 0], groups=576) /* ty=Tensor[(1, 92160, 1, 1), float32] */;
  %145 = reshape(%144, newshape=[1, 576, 160, 1, 1]) /* ty=Tensor[(1, 576, 160, 1, 1), float32] */;
  %146 = sum(%145, axis=[0]) /* ty=Tensor[(576, 160, 1, 1), float32] */;
  %147 = cast(%94, dtype="float32") /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %148 = greater_equal(%147, -128f /* ty=float32 */) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %149 = less_equal(%147, 127f /* ty=float32 */) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %150 = cast(%v14_conv_2_weight, dtype="float32") /* ty=Tensor[(160, 576, 1, 1), float32] */;
  %151 = multiply(%148, %149) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %152 = nn.conv2d_transpose(%139, %150, channels=576, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %153 = zeros(shape=[1, 576, 4, 4], dtype="float32") /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %154 = where(%151, %152, %153) /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %155 = reshape(%v14_conv_1_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 576, 1, 1), float32] */;
  %156 = multiply(%154, %155) /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %157 = cast(%93, dtype="float32") /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %158 = tile(%156, reps=[1, 1, 1, 1]) /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %159 = reshape(%157, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %160 = reshape(%158, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(576, 1, 4, 4), float32] */;
  %161 = nn.conv2d(%159, %160, padding=[1, 1, 1, 1], groups=576) /* ty=Tensor[(1, 576, 3, 3), float32] */;
  %162 = reshape(%161, newshape=[1, 1, 576, 3, 3]) /* ty=Tensor[(1, 1, 576, 3, 3), float32] */;
  %163 = sum(%162, axis=[0]) /* ty=Tensor[(1, 576, 3, 3), float32] */;
  %164 = cast(%92, dtype="float32") /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %165 = greater_equal(%164, -128f /* ty=float32 */) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %166 = less_equal(%164, 127f /* ty=float32 */) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %167 = cast(%v14_conv_1_weight, dtype="float32") /* ty=Tensor[(576, 1, 3, 3), float32] */;
  %168 = multiply(%165, %166) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %169 = nn.conv2d_transpose(%156, %167, channels=576, kernel_size=[3, 3], padding=[1, 1, 1, 1], groups=576, kernel_layout="IOHW") /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %170 = zeros(shape=[1, 576, 4, 4], dtype="float32") /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %171 = where(%168, %169, %170) /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %172 = reshape(%v14_conv_0_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 576, 1, 1), float32] */;
  %173 = multiply(%171, %172) /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %174 = cast(%91, dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %175 = tile(%173, reps=[1, 96, 1, 1]) /* ty=Tensor[(1, 55296, 4, 4), float32] */;
  %176 = reshape(%174, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %177 = reshape(%175, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(55296, 1, 4, 4), float32] */;
  %178 = nn.conv2d(%176, %177, padding=[0, 0, 0, 0], groups=96) /* ty=Tensor[(1, 55296, 1, 1), float32] */;
  %179 = reshape(%178, newshape=[1, 96, 576, 1, 1]) /* ty=Tensor[(1, 96, 576, 1, 1), float32] */;
  %180 = sum(%179, axis=[0]) /* ty=Tensor[(96, 576, 1, 1), float32] */;
  %181 = cast(%88, dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %182 = greater_equal(%181, -128f /* ty=float32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %183 = less_equal(%181, 127f /* ty=float32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %184 = cast(%90, dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %185 = greater_equal(%184, -128f /* ty=float32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %186 = less_equal(%184, 127f /* ty=float32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %187 = cast(%v14_conv_0_weight, dtype="float32") /* ty=Tensor[(576, 96, 1, 1), float32] */;
  %188 = multiply(%185, %186) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %189 = nn.conv2d_transpose(%173, %187, channels=96, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %190 = zeros(shape=[1, 96, 4, 4], dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %191 = where(%188, %189, %190) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %192 = reshape(%v13_qadd_scale_y, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %193 = divide(%191, %192) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %194 = reshape(%v13_qadd_scale_x2, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %195 = multiply(%182, %183) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %196 = multiply(%193, %194) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %197 = zeros(shape=[1, 96, 4, 4], dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %198 = where(%195, %196, %197) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %199 = reshape(%v13_conv_2_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 96, 1, 1), float32] */;
  %200 = multiply(%198, %199) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %201 = cast(%87, dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %202 = tile(%200, reps=[1, 384, 1, 1]) /* ty=Tensor[(1, 36864, 4, 4), float32] */;
  %203 = reshape(%201, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %204 = reshape(%202, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(36864, 1, 4, 4), float32] */;
  %205 = nn.conv2d(%203, %204, padding=[0, 0, 0, 0], groups=384) /* ty=Tensor[(1, 36864, 1, 1), float32] */;
  %206 = reshape(%205, newshape=[1, 384, 96, 1, 1]) /* ty=Tensor[(1, 384, 96, 1, 1), float32] */;
  %207 = sum(%206, axis=[0]) /* ty=Tensor[(384, 96, 1, 1), float32] */;
  %208 = cast(%86, dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %209 = greater_equal(%208, -128f /* ty=float32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %210 = less_equal(%208, 127f /* ty=float32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %211 = cast(%v13_conv_2_weight, dtype="float32") /* ty=Tensor[(96, 384, 1, 1), float32] */;
  %212 = multiply(%209, %210) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %213 = nn.conv2d_transpose(%200, %211, channels=384, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %214 = zeros(shape=[1, 384, 4, 4], dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %215 = where(%212, %213, %214) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %216 = reshape(%v13_conv_1_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 384, 1, 1), float32] */;
  %217 = multiply(%215, %216) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %218 = cast(%85, dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %219 = tile(%217, reps=[1, 1, 1, 1]) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %220 = reshape(%218, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %221 = reshape(%219, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(384, 1, 4, 4), float32] */;
  %222 = nn.conv2d(%220, %221, padding=[2, 2, 2, 2], groups=384) /* ty=Tensor[(1, 384, 5, 5), float32] */;
  %223 = reshape(%222, newshape=[1, 1, 384, 5, 5]) /* ty=Tensor[(1, 1, 384, 5, 5), float32] */;
  %224 = sum(%223, axis=[0]) /* ty=Tensor[(1, 384, 5, 5), float32] */;
  %225 = cast(%84, dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %226 = greater_equal(%225, -128f /* ty=float32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %227 = less_equal(%225, 127f /* ty=float32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %228 = cast(%v13_conv_1_weight, dtype="float32") /* ty=Tensor[(384, 1, 5, 5), float32] */;
  %229 = multiply(%226, %227) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %230 = nn.conv2d_transpose(%217, %228, channels=384, kernel_size=[5, 5], padding=[2, 2, 2, 2], groups=384, kernel_layout="IOHW") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %231 = zeros(shape=[1, 384, 4, 4], dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %232 = where(%229, %230, %231) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %233 = reshape(%v13_conv_0_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 384, 1, 1), float32] */;
  %234 = multiply(%232, %233) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %235 = cast(%83, dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %236 = tile(%234, reps=[1, 96, 1, 1]) /* ty=Tensor[(1, 36864, 4, 4), float32] */;
  %237 = reshape(%235, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %238 = reshape(%236, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(36864, 1, 4, 4), float32] */;
  %239 = nn.conv2d(%237, %238, padding=[0, 0, 0, 0], groups=96) /* ty=Tensor[(1, 36864, 1, 1), float32] */;
  %240 = reshape(%239, newshape=[1, 96, 384, 1, 1]) /* ty=Tensor[(1, 96, 384, 1, 1), float32] */;
  %241 = sum(%240, axis=[0]) /* ty=Tensor[(96, 384, 1, 1), float32] */;
  %242 = cast(%80, dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %243 = greater_equal(%242, -128f /* ty=float32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %244 = less_equal(%242, 127f /* ty=float32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %245 = cast(%82, dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %246 = greater_equal(%245, -128f /* ty=float32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %247 = less_equal(%245, 127f /* ty=float32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %248 = cast(%v13_conv_0_weight, dtype="float32") /* ty=Tensor[(384, 96, 1, 1), float32] */;
  %249 = multiply(%246, %247) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %250 = nn.conv2d_transpose(%234, %248, channels=96, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %251 = zeros(shape=[1, 96, 4, 4], dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %252 = where(%249, %250, %251) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %253 = reshape(%v12_qadd_scale_y, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %254 = divide(%252, %253) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %255 = reshape(%v12_qadd_scale_x2, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %256 = multiply(%243, %244) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %257 = multiply(%254, %255) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %258 = zeros(shape=[1, 96, 4, 4], dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %259 = where(%256, %257, %258) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %260 = reshape(%v12_conv_2_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 96, 1, 1), float32] */;
  %261 = multiply(%259, %260) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %262 = cast(%79, dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %263 = tile(%261, reps=[1, 384, 1, 1]) /* ty=Tensor[(1, 36864, 4, 4), float32] */;
  %264 = reshape(%262, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %265 = reshape(%263, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(36864, 1, 4, 4), float32] */;
  %266 = nn.conv2d(%264, %265, padding=[0, 0, 0, 0], groups=384) /* ty=Tensor[(1, 36864, 1, 1), float32] */;
  %267 = reshape(%266, newshape=[1, 384, 96, 1, 1]) /* ty=Tensor[(1, 384, 96, 1, 1), float32] */;
  %268 = sum(%267, axis=[0]) /* ty=Tensor[(384, 96, 1, 1), float32] */;
  %269 = cast(%78, dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %270 = greater_equal(%269, -128f /* ty=float32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %271 = less_equal(%269, 127f /* ty=float32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %272 = cast(%v12_conv_2_weight, dtype="float32") /* ty=Tensor[(96, 384, 1, 1), float32] */;
  %273 = multiply(%270, %271) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %274 = nn.conv2d_transpose(%261, %272, channels=384, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %275 = zeros(shape=[1, 384, 4, 4], dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %276 = where(%273, %274, %275) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %277 = reshape(%v12_conv_1_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 384, 1, 1), float32] */;
  %278 = multiply(%276, %277) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %279 = cast(%77, dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %280 = tile(%278, reps=[1, 1, 1, 1]) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %281 = reshape(%279, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %282 = reshape(%280, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(384, 1, 4, 4), float32] */;
  %283 = nn.conv2d(%281, %282, padding=[2, 2, 2, 2], groups=384) /* ty=Tensor[(1, 384, 5, 5), float32] */;
  %284 = reshape(%283, newshape=[1, 1, 384, 5, 5]) /* ty=Tensor[(1, 1, 384, 5, 5), float32] */;
  %285 = sum(%284, axis=[0]) /* ty=Tensor[(1, 384, 5, 5), float32] */;
  %286 = cast(%76, dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %287 = greater_equal(%286, -128f /* ty=float32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %288 = less_equal(%286, 127f /* ty=float32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %289 = cast(%v12_conv_1_weight, dtype="float32") /* ty=Tensor[(384, 1, 5, 5), float32] */;
  %290 = multiply(%287, %288) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %291 = nn.conv2d_transpose(%278, %289, channels=384, kernel_size=[5, 5], padding=[2, 2, 2, 2], groups=384, kernel_layout="IOHW") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %292 = zeros(shape=[1, 384, 4, 4], dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %293 = where(%290, %291, %292) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %294 = reshape(%v12_conv_0_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 384, 1, 1), float32] */;
  %295 = multiply(%293, %294) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %296 = cast(%75, dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %297 = tile(%295, reps=[1, 96, 1, 1]) /* ty=Tensor[(1, 36864, 4, 4), float32] */;
  %298 = reshape(%296, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %299 = reshape(%297, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(36864, 1, 4, 4), float32] */;
  %300 = nn.conv2d(%298, %299, padding=[0, 0, 0, 0], groups=96) /* ty=Tensor[(1, 36864, 1, 1), float32] */;
  %301 = reshape(%300, newshape=[1, 96, 384, 1, 1]) /* ty=Tensor[(1, 96, 384, 1, 1), float32] */;
  %302 = sum(%301, axis=[0]) /* ty=Tensor[(96, 384, 1, 1), float32] */;
  %303 = cast(%74, dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %304 = greater_equal(%303, -128f /* ty=float32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %305 = less_equal(%303, 127f /* ty=float32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %306 = cast(%v12_conv_0_weight, dtype="float32") /* ty=Tensor[(384, 96, 1, 1), float32] */;
  %307 = multiply(%304, %305) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %308 = nn.conv2d_transpose(%295, %306, channels=96, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %309 = zeros(shape=[1, 96, 4, 4], dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %310 = where(%307, %308, %309) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %311 = reshape(%v11_conv_2_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 96, 1, 1), float32] */;
  %312 = multiply(%310, %311) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %313 = cast(%73, dtype="float32") /* ty=Tensor[(1, 240, 4, 4), float32] */;
  %314 = tile(%312, reps=[1, 240, 1, 1]) /* ty=Tensor[(1, 23040, 4, 4), float32] */;
  %315 = reshape(%313, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 240, 4, 4), float32] */;
  %316 = reshape(%314, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(23040, 1, 4, 4), float32] */;
  %317 = nn.conv2d(%315, %316, padding=[0, 0, 0, 0], groups=240) /* ty=Tensor[(1, 23040, 1, 1), float32] */;
  %318 = reshape(%317, newshape=[1, 240, 96, 1, 1]) /* ty=Tensor[(1, 240, 96, 1, 1), float32] */;
  %319 = sum(%318, axis=[0]) /* ty=Tensor[(240, 96, 1, 1), float32] */;
  %320 = cast(%72, dtype="float32") /* ty=Tensor[(1, 240, 4, 4), float32] */;
  %321 = greater_equal(%320, -128f /* ty=float32 */) /* ty=Tensor[(1, 240, 4, 4), bool] */;
  %322 = less_equal(%320, 127f /* ty=float32 */) /* ty=Tensor[(1, 240, 4, 4), bool] */;
  %323 = cast(%v11_conv_2_weight, dtype="float32") /* ty=Tensor[(96, 240, 1, 1), float32] */;
  %324 = multiply(%321, %322) /* ty=Tensor[(1, 240, 4, 4), bool] */;
  %325 = nn.conv2d_transpose(%312, %323, channels=240, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 240, 4, 4), float32] */;
  %326 = zeros(shape=[1, 240, 4, 4], dtype="float32") /* ty=Tensor[(1, 240, 4, 4), float32] */;
  %327 = where(%324, %325, %326) /* ty=Tensor[(1, 240, 4, 4), float32] */;
  %328 = reshape(%v11_conv_1_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 240, 1, 1), float32] */;
  %329 = multiply(%327, %328) /* ty=Tensor[(1, 240, 4, 4), float32] */;
  %330 = cast(%71, dtype="float32") /* ty=Tensor[(1, 240, 8, 8), float32] */;
  %331 = tile(%329, reps=[1, 1, 1, 1]) /* ty=Tensor[(1, 240, 4, 4), float32] */;
  %332 = reshape(%330, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 240, 8, 8), float32] */;
  %333 = reshape(%331, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(240, 1, 4, 4), float32] */;
  %334 = nn.conv2d(%332, %333, padding=[3, 3, 3, 3], dilation=[2, 2], groups=240) /* ty=Tensor[(1, 240, 8, 8), float32] */;
  %335 = reshape(%334, newshape=[1, 1, 240, 8, 8]) /* ty=Tensor[(1, 1, 240, 8, 8), float32] */;
  %336 = sum(%335, axis=[0]) /* ty=Tensor[(1, 240, 8, 8), float32] */;
  %337 = transpose(%336, axes=[1, 0, 2, 3]) /* ty=Tensor[(240, 1, 8, 8), float32] */;
  %338 = cast(%70, dtype="float32") /* ty=Tensor[(1, 240, 8, 8), float32] */;
  %339 = greater_equal(%338, -128f /* ty=float32 */) /* ty=Tensor[(1, 240, 8, 8), bool] */;
  %340 = less_equal(%338, 127f /* ty=float32 */) /* ty=Tensor[(1, 240, 8, 8), bool] */;
  %341 = cast(%v11_conv_1_weight, dtype="float32") /* ty=Tensor[(240, 1, 7, 7), float32] */;
  %342 = multiply(%339, %340) /* ty=Tensor[(1, 240, 8, 8), bool] */;
  %343 = nn.conv2d_transpose(%329, %341, channels=240, kernel_size=[7, 7], strides=[2, 2], output_padding=[1, 1], padding=[3, 3, 3, 3], groups=240, kernel_layout="IOHW") /* ty=Tensor[(1, 240, 8, 8), float32] */;
  %344 = zeros(shape=[1, 240, 8, 8], dtype="float32") /* ty=Tensor[(1, 240, 8, 8), float32] */;
  %345 = where(%342, %343, %344) /* ty=Tensor[(1, 240, 8, 8), float32] */;
  %346 = reshape(%v11_conv_0_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 240, 1, 1), float32] */;
  %347 = multiply(%345, %346) /* ty=Tensor[(1, 240, 8, 8), float32] */;
  %348 = cast(%69, dtype="float32") /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %349 = tile(%347, reps=[1, 48, 1, 1]) /* ty=Tensor[(1, 11520, 8, 8), float32] */;
  %350 = reshape(%348, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %351 = reshape(%349, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(11520, 1, 8, 8), float32] */;
  %352 = nn.conv2d(%350, %351, padding=[0, 0, 0, 0], groups=48) /* ty=Tensor[(1, 11520, 1, 1), float32] */;
  %353 = reshape(%352, newshape=[1, 48, 240, 1, 1]) /* ty=Tensor[(1, 48, 240, 1, 1), float32] */;
  %354 = sum(%353, axis=[0]) /* ty=Tensor[(48, 240, 1, 1), float32] */;
  %355 = cast(%66, dtype="float32") /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %356 = greater_equal(%355, -128f /* ty=float32 */) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %357 = less_equal(%355, 127f /* ty=float32 */) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %358 = cast(%68, dtype="float32") /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %359 = greater_equal(%358, -128f /* ty=float32 */) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %360 = less_equal(%358, 127f /* ty=float32 */) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %361 = cast(%v11_conv_0_weight, dtype="float32") /* ty=Tensor[(240, 48, 1, 1), float32] */;
  %362 = multiply(%359, %360) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %363 = nn.conv2d_transpose(%347, %361, channels=48, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %364 = zeros(shape=[1, 48, 8, 8], dtype="float32") /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %365 = where(%362, %363, %364) /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %366 = reshape(%v10_qadd_scale_y, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %367 = divide(%365, %366) /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %368 = reshape(%v10_qadd_scale_x2, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %369 = multiply(%356, %357) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %370 = multiply(%367, %368) /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %371 = zeros(shape=[1, 48, 8, 8], dtype="float32") /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %372 = where(%369, %370, %371) /* ty=Tensor[(1, 48, 8, 8), float32] */;
