def @main(%input: Tensor[(1, 3, 128, 128), int8], %v0_weight: Tensor[(16, 3, 3, 3), int8], %v0_bias: Tensor[(16), int32], %v0_zero_x: Tensor[(1), int8], %v0_zero_y: Tensor[(1), int8], %v0_scale: Tensor[(16), float32], %v1_conv_0_weight: Tensor[(16, 1, 3, 3), int8], %v1_conv_0_bias: Tensor[(16), int32], %v1_conv_0_zero_x: Tensor[(1), int8], %v1_conv_0_zero_y: Tensor[(1), int8], %v1_conv_0_scale: Tensor[(16), float32], %v1_conv_1_weight: Tensor[(8, 16, 1, 1), int8], %v1_conv_1_bias: Tensor[(8), int32], %v1_conv_1_zero_x: Tensor[(1), int8], %v1_conv_1_zero_y: Tensor[(1), int8], %v1_conv_1_scale: Tensor[(8), float32], %v2_conv_0_weight: Tensor[(32, 8, 1, 1), int8], %v2_conv_0_bias: Tensor[(32), int32], %v2_conv_0_zero_x: Tensor[(1), int8], %v2_conv_0_zero_y: Tensor[(1), int8], %v2_conv_0_scale: Tensor[(32), float32], %v2_conv_1_weight: Tensor[(32, 1, 3, 3), int8], %v2_conv_1_bias: Tensor[(32), int32], %v2_conv_1_zero_x: Tensor[(1), int8], %v2_conv_1_zero_y: Tensor[(1), int8], %v2_conv_1_scale: Tensor[(32), float32], %v2_conv_2_weight: Tensor[(16, 32, 1, 1), int8], %v2_conv_2_bias: Tensor[(16), int32], %v2_conv_2_zero_x: Tensor[(1), int8], %v2_conv_2_zero_y: Tensor[(1), int8], %v2_conv_2_scale: Tensor[(16), float32], %v3_conv_0_weight: Tensor[(48, 16, 1, 1), int8], %v3_conv_0_bias: Tensor[(48), int32], %v3_conv_0_zero_x: Tensor[(1), int8], %v3_conv_0_zero_y: Tensor[(1), int8], %v3_conv_0_scale: Tensor[(48), float32], %v3_conv_1_weight: Tensor[(48, 1, 3, 3), int8], %v3_conv_1_bias: Tensor[(48), int32], %v3_conv_1_zero_x: Tensor[(1), int8], %v3_conv_1_zero_y: Tensor[(1), int8], %v3_conv_1_scale: Tensor[(48), float32], %v3_conv_2_weight: Tensor[(16, 48, 1, 1), int8], %v3_conv_2_bias: Tensor[(16), int32], %v3_conv_2_zero_x: Tensor[(1), int8], %v3_conv_2_zero_y: Tensor[(1), int8], %v3_conv_2_scale: Tensor[(16), float32], %v3_qadd_zero_x1: Tensor[(1), int8], %v3_qadd_zero_x2: Tensor[(1), int8], %v3_qadd_scale_x1: Tensor[(1), float32], %v3_qadd_scale_x2: Tensor[(1), float32], %v3_qadd_zero_y: Tensor[(1), int8], %v3_qadd_scale_y: Tensor[(1), float32], %v4_conv_0_weight: Tensor[(48, 16, 1, 1), int8], %v4_conv_0_bias: Tensor[(48), int32], %v4_conv_0_zero_x: Tensor[(1), int8], %v4_conv_0_zero_y: Tensor[(1), int8], %v4_conv_0_scale: Tensor[(48), float32], %v4_conv_1_weight: Tensor[(48, 1, 7, 7), int8], %v4_conv_1_bias: Tensor[(48), int32], %v4_conv_1_zero_x: Tensor[(1), int8], %v4_conv_1_zero_y: Tensor[(1), int8], %v4_conv_1_scale: Tensor[(48), float32], %v4_conv_2_weight: Tensor[(24, 48, 1, 1), int8], %v4_conv_2_bias: Tensor[(24), int32], %v4_conv_2_zero_x: Tensor[(1), int8], %v4_conv_2_zero_y: Tensor[(1), int8], %v4_conv_2_scale: Tensor[(24), float32], %v5_conv_0_weight: Tensor[(120, 24, 1, 1), int8], %v5_conv_0_bias: Tensor[(120), int32], %v5_conv_0_zero_x: Tensor[(1), int8], %v5_conv_0_zero_y: Tensor[(1), int8], %v5_conv_0_scale: Tensor[(120), float32], %v5_conv_1_weight: Tensor[(120, 1, 3, 3), int8], %v5_conv_1_bias: Tensor[(120), int32], %v5_conv_1_zero_x: Tensor[(1), int8], %v5_conv_1_zero_y: Tensor[(1), int8], %v5_conv_1_scale: Tensor[(120), float32], %v5_conv_2_weight: Tensor[(24, 120, 1, 1), int8], %v5_conv_2_bias: Tensor[(24), int32], %v5_conv_2_zero_x: Tensor[(1), int8], %v5_conv_2_zero_y: Tensor[(1), int8], %v5_conv_2_scale: Tensor[(24), float32], %v5_qadd_zero_x1: Tensor[(1), int8], %v5_qadd_zero_x2: Tensor[(1), int8], %v5_qadd_scale_x1: Tensor[(1), float32], %v5_qadd_scale_x2: Tensor[(1), float32], %v5_qadd_zero_y: Tensor[(1), int8], %v5_qadd_scale_y: Tensor[(1), float32], %v6_conv_0_weight: Tensor[(120, 24, 1, 1), int8], %v6_conv_0_bias: Tensor[(120), int32], %v6_conv_0_zero_x: Tensor[(1), int8], %v6_conv_0_zero_y: Tensor[(1), int8], %v6_conv_0_scale: Tensor[(120), float32], %v6_conv_1_weight: Tensor[(120, 1, 3, 3), int8], %v6_conv_1_bias: Tensor[(120), int32], %v6_conv_1_zero_x: Tensor[(1), int8], %v6_conv_1_zero_y: Tensor[(1), int8], %v6_conv_1_scale: Tensor[(120), float32], %v6_conv_2_weight: Tensor[(40, 120, 1, 1), int8], %v6_conv_2_bias: Tensor[(40), int32], %v6_conv_2_zero_x: Tensor[(1), int8], %v6_conv_2_zero_y: Tensor[(1), int8], %v6_conv_2_scale: Tensor[(40), float32], %v7_conv_0_weight: Tensor[(160, 40, 1, 1), int8], %v7_conv_0_bias: Tensor[(160), int32], %v7_conv_0_zero_x: Tensor[(1), int8], %v7_conv_0_zero_y: Tensor[(1), int8], %v7_conv_0_scale: Tensor[(160), float32], %v7_conv_1_weight: Tensor[(160, 1, 7, 7), int8], %v7_conv_1_bias: Tensor[(160), int32], %v7_conv_1_zero_x: Tensor[(1), int8], %v7_conv_1_zero_y: Tensor[(1), int8], %v7_conv_1_scale: Tensor[(160), float32], %v7_conv_2_weight: Tensor[(40, 160, 1, 1), int8], %v7_conv_2_bias: Tensor[(40), int32], %v7_conv_2_zero_x: Tensor[(1), int8], %v7_conv_2_zero_y: Tensor[(1), int8], %v7_conv_2_scale: Tensor[(40), float32], %v7_qadd_zero_x1: Tensor[(1), int8], %v7_qadd_zero_x2: Tensor[(1), int8], %v7_qadd_scale_x1: Tensor[(1), float32], %v7_qadd_scale_x2: Tensor[(1), float32], %v7_qadd_zero_y: Tensor[(1), int8], %v7_qadd_scale_y: Tensor[(1), float32], %v8_conv_0_weight: Tensor[(160, 40, 1, 1), int8], %v8_conv_0_bias: Tensor[(160), int32], %v8_conv_0_zero_x: Tensor[(1), int8], %v8_conv_0_zero_y: Tensor[(1), int8], %v8_conv_0_scale: Tensor[(160), float32], %v8_conv_1_weight: Tensor[(160, 1, 5, 5), int8], %v8_conv_1_bias: Tensor[(160), int32], %v8_conv_1_zero_x: Tensor[(1), int8], %v8_conv_1_zero_y: Tensor[(1), int8], %v8_conv_1_scale: Tensor[(160), float32], %v8_conv_2_weight: Tensor[(48, 160, 1, 1), int8], %v8_conv_2_bias: Tensor[(48), int32], %v8_conv_2_zero_x: Tensor[(1), int8], %v8_conv_2_zero_y: Tensor[(1), int8], %v8_conv_2_scale: Tensor[(48), float32], %v9_conv_0_weight: Tensor[(144, 48, 1, 1), int8], %v9_conv_0_bias: Tensor[(144), int32], %v9_conv_0_zero_x: Tensor[(1), int8], %v9_conv_0_zero_y: Tensor[(1), int8], %v9_conv_0_scale: Tensor[(144), float32], %v9_conv_1_weight: Tensor[(144, 1, 3, 3), int8], %v9_conv_1_bias: Tensor[(144), int32], %v9_conv_1_zero_x: Tensor[(1), int8], %v9_conv_1_zero_y: Tensor[(1), int8], %v9_conv_1_scale: Tensor[(144), float32], %v9_conv_2_weight: Tensor[(48, 144, 1, 1), int8], %v9_conv_2_bias: Tensor[(48), int32], %v9_conv_2_zero_x: Tensor[(1), int8], %v9_conv_2_zero_y: Tensor[(1), int8], %v9_conv_2_scale: Tensor[(48), float32], %v9_qadd_zero_x1: Tensor[(1), int8], %v9_qadd_zero_x2: Tensor[(1), int8], %v9_qadd_scale_x1: Tensor[(1), float32], %v9_qadd_scale_x2: Tensor[(1), float32], %v9_qadd_zero_y: Tensor[(1), int8], %v9_qadd_scale_y: Tensor[(1), float32], %v10_conv_0_weight: Tensor[(192, 48, 1, 1), int8], %v10_conv_0_bias: Tensor[(192), int32], %v10_conv_0_zero_x: Tensor[(1), int8], %v10_conv_0_zero_y: Tensor[(1), int8], %v10_conv_0_scale: Tensor[(192), float32], %v10_conv_1_weight: Tensor[(192, 1, 3, 3), int8], %v10_conv_1_bias: Tensor[(192), int32], %v10_conv_1_zero_x: Tensor[(1), int8], %v10_conv_1_zero_y: Tensor[(1), int8], %v10_conv_1_scale: Tensor[(192), float32], %v10_conv_2_weight: Tensor[(48, 192, 1, 1), int8], %v10_conv_2_bias: Tensor[(48), int32], %v10_conv_2_zero_x: Tensor[(1), int8], %v10_conv_2_zero_y: Tensor[(1), int8], %v10_conv_2_scale: Tensor[(48), float32], %v10_qadd_zero_x1: Tensor[(1), int8], %v10_qadd_zero_x2: Tensor[(1), int8], %v10_qadd_scale_x1: Tensor[(1), float32], %v10_qadd_scale_x2: Tensor[(1), float32], %v10_qadd_zero_y: Tensor[(1), int8], %v10_qadd_scale_y: Tensor[(1), float32], %v11_conv_0_weight: Tensor[(240, 48, 1, 1), int8], %v11_conv_0_bias: Tensor[(240), int32], %v11_conv_0_zero_x: Tensor[(1), int8], %v11_conv_0_zero_y: Tensor[(1), int8], %v11_conv_0_scale: Tensor[(240), float32], %v11_conv_1_weight: Tensor[(240, 1, 7, 7), int8], %v11_conv_1_bias: Tensor[(240), int32], %v11_conv_1_zero_x: Tensor[(1), int8], %v11_conv_1_zero_y: Tensor[(1), int8], %v11_conv_1_scale: Tensor[(240), float32], %v11_conv_2_weight: Tensor[(96, 240, 1, 1), int8], %v11_conv_2_bias: Tensor[(96), int32], %v11_conv_2_zero_x: Tensor[(1), int8], %v11_conv_2_zero_y: Tensor[(1), int8], %v11_conv_2_scale: Tensor[(96), float32], %v12_conv_0_weight: Tensor[(384, 96, 1, 1), int8], %v12_conv_0_bias: Tensor[(384), int32], %v12_conv_0_zero_x: Tensor[(1), int8], %v12_conv_0_zero_y: Tensor[(1), int8], %v12_conv_0_scale: Tensor[(384), float32], %v12_conv_1_weight: Tensor[(384, 1, 5, 5), int8], %v12_conv_1_bias: Tensor[(384), int32], %v12_conv_1_zero_x: Tensor[(1), int8], %v12_conv_1_zero_y: Tensor[(1), int8], %v12_conv_1_scale: Tensor[(384), float32], %v12_conv_2_weight: Tensor[(96, 384, 1, 1), int8], %v12_conv_2_bias: Tensor[(96), int32], %v12_conv_2_zero_x: Tensor[(1), int8], %v12_conv_2_zero_y: Tensor[(1), int8], %v12_conv_2_scale: Tensor[(96), float32], %v12_qadd_zero_x1: Tensor[(1), int8], %v12_qadd_zero_x2: Tensor[(1), int8], %v12_qadd_scale_x1: Tensor[(1), float32], %v12_qadd_scale_x2: Tensor[(1), float32], %v12_qadd_zero_y: Tensor[(1), int8], %v12_qadd_scale_y: Tensor[(1), float32], %v13_conv_0_weight: Tensor[(384, 96, 1, 1), int8], %v13_conv_0_bias: Tensor[(384), int32], %v13_conv_0_zero_x: Tensor[(1), int8], %v13_conv_0_zero_y: Tensor[(1), int8], %v13_conv_0_scale: Tensor[(384), float32], %v13_conv_1_weight: Tensor[(384, 1, 5, 5), int8], %v13_conv_1_bias: Tensor[(384), int32], %v13_conv_1_zero_x: Tensor[(1), int8], %v13_conv_1_zero_y: Tensor[(1), int8], %v13_conv_1_scale: Tensor[(384), float32], %v13_conv_2_weight: Tensor[(96, 384, 1, 1), int8], %v13_conv_2_bias: Tensor[(96), int32], %v13_conv_2_zero_x: Tensor[(1), int8], %v13_conv_2_zero_y: Tensor[(1), int8], %v13_conv_2_scale: Tensor[(96), float32], %v13_qadd_zero_x1: Tensor[(1), int8], %v13_qadd_zero_x2: Tensor[(1), int8], %v13_qadd_scale_x1: Tensor[(1), float32], %v13_qadd_scale_x2: Tensor[(1), float32], %v13_qadd_zero_y: Tensor[(1), int8], %v13_qadd_scale_y: Tensor[(1), float32], %v14_conv_0_weight: Tensor[(576, 96, 1, 1), int8], %v14_conv_0_bias: Tensor[(576), int32], %v14_conv_0_zero_x: Tensor[(1), int8], %v14_conv_0_zero_y: Tensor[(1), int8], %v14_conv_0_scale: Tensor[(576), float32], %v14_conv_1_weight: Tensor[(576, 1, 3, 3), int8], %v14_conv_1_bias: Tensor[(576), int32], %v14_conv_1_zero_x: Tensor[(1), int8], %v14_conv_1_zero_y: Tensor[(1), int8], %v14_conv_1_scale: Tensor[(576), float32], %v14_conv_2_weight: Tensor[(160, 576, 1, 1), int8], %v14_conv_2_bias: Tensor[(160), int32], %v14_conv_2_zero_x: Tensor[(1), int8], %v14_conv_2_zero_y: Tensor[(1), int8], %v14_conv_2_scale: Tensor[(160), float32], %v15_weight: Tensor[(10, 160, 1, 1), int8], %v15_bias: Tensor[(10), int32], %v15_zero_x: Tensor[(1), int8], %v15_zero_y: Tensor[(1), int8], %v15_scale: Tensor[(10), float32], %label: Tensor[(1, 10), float32]) -> (float32, Tensor[(10), int32], Tensor[(10, 160, 1, 1), int8], Tensor[(160), int32], Tensor[(576), int32], Tensor[(576), float32], Tensor[(576, 48, 1, 1), float32], Tensor[(96), int32], Tensor[(384), int32], Tensor[(384), int32], Tensor[(384, 96, 1, 1), int8], Tensor[(96), int32], Tensor[(384), int32], Tensor[(384), int32], Tensor[(96), int32], Tensor[(240), int32], Tensor[(240), int32], Tensor[(240, 48, 1, 1), int8], Tensor[(48), int32], Tensor[(192), int32], Tensor[(192), int32], Tensor[(192, 48, 1, 1), int8], Tensor[(48), int32], Tensor[(144), int32], Tensor[(144), int32], Tensor[(144, 48, 1, 1), int8], Tensor[(48), int32], Tensor[(160), int32], Tensor[(160), int32], Tensor[(160, 40, 1, 1), int8], Tensor[(40), int32], Tensor[(160), int32]) {
  %0 = nn.mcuconv2d(%input, %v0_weight, %v0_bias, %v0_zero_x, %v0_zero_y, %v0_scale, strides=[2, 2], padding=[1, 1, 1, 1]) /* ty=Tensor[(1, 16, 64, 64), int32] */;
  %1 = nn.mcutruncate(%0) /* ty=Tensor[(1, 16, 64, 64), int8] */;
  %2 = nn.mcuconv2d(%1, %v1_conv_0_weight, %v1_conv_0_bias, %v1_conv_0_zero_x, %v1_conv_0_zero_y, %v1_conv_0_scale, padding=[1, 1, 1, 1], groups=16) /* ty=Tensor[(1, 16, 64, 64), int32] */;
  %3 = nn.mcutruncate(%2) /* ty=Tensor[(1, 16, 64, 64), int8] */;
  %4 = nn.mcuconv2d(%3, %v1_conv_1_weight, %v1_conv_1_bias, %v1_conv_1_zero_x, %v1_conv_1_zero_y, %v1_conv_1_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 8, 64, 64), int32] */;
  %5 = nn.mcutruncate(%4) /* ty=Tensor[(1, 8, 64, 64), int8] */;
  %6 = nn.mcuconv2d(%5, %v2_conv_0_weight, %v2_conv_0_bias, %v2_conv_0_zero_x, %v2_conv_0_zero_y, %v2_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 32, 64, 64), int32] */;
  %7 = nn.mcutruncate(%6) /* ty=Tensor[(1, 32, 64, 64), int8] */;
  %8 = nn.mcuconv2d(%7, %v2_conv_1_weight, %v2_conv_1_bias, %v2_conv_1_zero_x, %v2_conv_1_zero_y, %v2_conv_1_scale, strides=[2, 2], padding=[1, 1, 1, 1], groups=32) /* ty=Tensor[(1, 32, 32, 32), int32] */;
  %9 = nn.mcutruncate(%8) /* ty=Tensor[(1, 32, 32, 32), int8] */;
  %10 = nn.mcuconv2d(%9, %v2_conv_2_weight, %v2_conv_2_bias, %v2_conv_2_zero_x, %v2_conv_2_zero_y, %v2_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 16, 32, 32), int32] */;
  %11 = nn.mcutruncate(%10) /* ty=Tensor[(1, 16, 32, 32), int8] */;
  %12 = nn.mcuconv2d(%11, %v3_conv_0_weight, %v3_conv_0_bias, %v3_conv_0_zero_x, %v3_conv_0_zero_y, %v3_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %13 = nn.mcutruncate(%12) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %14 = nn.mcuconv2d(%13, %v3_conv_1_weight, %v3_conv_1_bias, %v3_conv_1_zero_x, %v3_conv_1_zero_y, %v3_conv_1_scale, padding=[1, 1, 1, 1], groups=48) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %15 = nn.mcutruncate(%14) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %16 = nn.mcuconv2d(%15, %v3_conv_2_weight, %v3_conv_2_bias, %v3_conv_2_zero_x, %v3_conv_2_zero_y, %v3_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 16, 32, 32), int32] */;
  %17 = nn.mcutruncate(%16) /* ty=Tensor[(1, 16, 32, 32), int8] */;
  %18 = nn.mcuadd(%11, %17, %v3_qadd_zero_x1, %v3_qadd_zero_x2, %v3_qadd_scale_x1, %v3_qadd_scale_x2, %v3_qadd_zero_y, %v3_qadd_scale_y, axis=0) /* ty=Tensor[(1, 16, 32, 32), int8] */;
  %19 = nn.mcutruncate(%18) /* ty=Tensor[(1, 16, 32, 32), int8] */;
  %20 = nn.mcuconv2d(%19, %v4_conv_0_weight, %v4_conv_0_bias, %v4_conv_0_zero_x, %v4_conv_0_zero_y, %v4_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %21 = nn.mcutruncate(%20) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %22 = nn.mcuconv2d(%21, %v4_conv_1_weight, %v4_conv_1_bias, %v4_conv_1_zero_x, %v4_conv_1_zero_y, %v4_conv_1_scale, strides=[2, 2], padding=[3, 3, 3, 3], groups=48) /* ty=Tensor[(1, 48, 16, 16), int32] */;
  %23 = nn.mcutruncate(%22) /* ty=Tensor[(1, 48, 16, 16), int8] */;
  %24 = nn.mcuconv2d(%23, %v4_conv_2_weight, %v4_conv_2_bias, %v4_conv_2_zero_x, %v4_conv_2_zero_y, %v4_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 24, 16, 16), int32] */;
  %25 = nn.mcutruncate(%24) /* ty=Tensor[(1, 24, 16, 16), int8] */;
  %26 = nn.mcuconv2d(%25, %v5_conv_0_weight, %v5_conv_0_bias, %v5_conv_0_zero_x, %v5_conv_0_zero_y, %v5_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 120, 16, 16), int32] */;
  %27 = nn.mcutruncate(%26) /* ty=Tensor[(1, 120, 16, 16), int8] */;
  %28 = nn.mcuconv2d(%27, %v5_conv_1_weight, %v5_conv_1_bias, %v5_conv_1_zero_x, %v5_conv_1_zero_y, %v5_conv_1_scale, padding=[1, 1, 1, 1], groups=120) /* ty=Tensor[(1, 120, 16, 16), int32] */;
  %29 = nn.mcutruncate(%28) /* ty=Tensor[(1, 120, 16, 16), int8] */;
  %30 = nn.mcuconv2d(%29, %v5_conv_2_weight, %v5_conv_2_bias, %v5_conv_2_zero_x, %v5_conv_2_zero_y, %v5_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 24, 16, 16), int32] */;
  %31 = nn.mcutruncate(%30) /* ty=Tensor[(1, 24, 16, 16), int8] */;
  %32 = nn.mcuadd(%25, %31, %v5_qadd_zero_x1, %v5_qadd_zero_x2, %v5_qadd_scale_x1, %v5_qadd_scale_x2, %v5_qadd_zero_y, %v5_qadd_scale_y, axis=0) /* ty=Tensor[(1, 24, 16, 16), int8] */;
  %33 = nn.mcutruncate(%32) /* ty=Tensor[(1, 24, 16, 16), int8] */;
  %34 = nn.mcuconv2d(%33, %v6_conv_0_weight, %v6_conv_0_bias, %v6_conv_0_zero_x, %v6_conv_0_zero_y, %v6_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 120, 16, 16), int32] */;
  %35 = nn.mcutruncate(%34) /* ty=Tensor[(1, 120, 16, 16), int8] */;
  %36 = nn.mcuconv2d(%35, %v6_conv_1_weight, %v6_conv_1_bias, %v6_conv_1_zero_x, %v6_conv_1_zero_y, %v6_conv_1_scale, strides=[2, 2], padding=[1, 1, 1, 1], groups=120) /* ty=Tensor[(1, 120, 8, 8), int32] */;
  %37 = nn.mcutruncate(%36) /* ty=Tensor[(1, 120, 8, 8), int8] */;
  %38 = nn.mcuconv2d(%37, %v6_conv_2_weight, %v6_conv_2_bias, %v6_conv_2_zero_x, %v6_conv_2_zero_y, %v6_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 40, 8, 8), int32] */;
  %39 = nn.mcutruncate(%38) /* ty=Tensor[(1, 40, 8, 8), int8] */;
  %40 = nn.mcuconv2d(%39, %v7_conv_0_weight, %v7_conv_0_bias, %v7_conv_0_zero_x, %v7_conv_0_zero_y, %v7_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 160, 8, 8), int32] */;
  %41 = nn.mcutruncate(%40) /* ty=Tensor[(1, 160, 8, 8), int8] */;
  %42 = nn.mcuconv2d(%41, %v7_conv_1_weight, %v7_conv_1_bias, %v7_conv_1_zero_x, %v7_conv_1_zero_y, %v7_conv_1_scale, padding=[3, 3, 3, 3], groups=160) /* ty=Tensor[(1, 160, 8, 8), int32] */;
  %43 = nn.mcutruncate(%42) /* ty=Tensor[(1, 160, 8, 8), int8] */;
  %44 = nn.mcuconv2d(%43, %v7_conv_2_weight, %v7_conv_2_bias, %v7_conv_2_zero_x, %v7_conv_2_zero_y, %v7_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 40, 8, 8), int32] */;
  %45 = nn.mcutruncate(%44) /* ty=Tensor[(1, 40, 8, 8), int8] */;
  %46 = nn.mcuadd(%39, %45, %v7_qadd_zero_x1, %v7_qadd_zero_x2, %v7_qadd_scale_x1, %v7_qadd_scale_x2, %v7_qadd_zero_y, %v7_qadd_scale_y, axis=0) /* ty=Tensor[(1, 40, 8, 8), int8] */;
  %47 = nn.mcutruncate(%46) /* ty=Tensor[(1, 40, 8, 8), int8] */;
  %48 = nn.mcuconv2d(%47, %v8_conv_0_weight, %v8_conv_0_bias, %v8_conv_0_zero_x, %v8_conv_0_zero_y, %v8_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 160, 8, 8), int32] */;
  %49 = nn.mcutruncate(%48) /* ty=Tensor[(1, 160, 8, 8), int8] */;
  %50 = nn.mcuconv2d(%49, %v8_conv_1_weight, %v8_conv_1_bias, %v8_conv_1_zero_x, %v8_conv_1_zero_y, %v8_conv_1_scale, padding=[2, 2, 2, 2], groups=160) /* ty=Tensor[(1, 160, 8, 8), int32] */;
  %51 = nn.mcutruncate(%50) /* ty=Tensor[(1, 160, 8, 8), int8] */;
  %52 = nn.mcuconv2d(%51, %v8_conv_2_weight, %v8_conv_2_bias, %v8_conv_2_zero_x, %v8_conv_2_zero_y, %v8_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %53 = nn.mcutruncate(%52) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %54 = nn.mcuconv2d(%53, %v9_conv_0_weight, %v9_conv_0_bias, %v9_conv_0_zero_x, %v9_conv_0_zero_y, %v9_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %55 = nn.mcutruncate(%54) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %56 = nn.mcuconv2d(%55, %v9_conv_1_weight, %v9_conv_1_bias, %v9_conv_1_zero_x, %v9_conv_1_zero_y, %v9_conv_1_scale, padding=[1, 1, 1, 1], groups=144) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %57 = nn.mcutruncate(%56) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %58 = nn.mcuconv2d(%57, %v9_conv_2_weight, %v9_conv_2_bias, %v9_conv_2_zero_x, %v9_conv_2_zero_y, %v9_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %59 = nn.mcutruncate(%58) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %60 = nn.mcuadd(%53, %59, %v9_qadd_zero_x1, %v9_qadd_zero_x2, %v9_qadd_scale_x1, %v9_qadd_scale_x2, %v9_qadd_zero_y, %v9_qadd_scale_y, axis=0) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %61 = nn.mcutruncate(%60) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %62 = nn.mcuconv2d(%61, %v10_conv_0_weight, %v10_conv_0_bias, %v10_conv_0_zero_x, %v10_conv_0_zero_y, %v10_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %63 = nn.mcutruncate(%62) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %64 = nn.mcuconv2d(%63, %v10_conv_1_weight, %v10_conv_1_bias, %v10_conv_1_zero_x, %v10_conv_1_zero_y, %v10_conv_1_scale, padding=[1, 1, 1, 1], groups=192) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %65 = nn.mcutruncate(%64) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %66 = nn.mcuconv2d(%65, %v10_conv_2_weight, %v10_conv_2_bias, %v10_conv_2_zero_x, %v10_conv_2_zero_y, %v10_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %67 = nn.mcutruncate(%66) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %68 = nn.mcuadd(%61, %67, %v10_qadd_zero_x1, %v10_qadd_zero_x2, %v10_qadd_scale_x1, %v10_qadd_scale_x2, %v10_qadd_zero_y, %v10_qadd_scale_y, axis=0) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %69 = nn.mcutruncate(%68) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %70 = nn.mcuconv2d(%69, %v11_conv_0_weight, %v11_conv_0_bias, %v11_conv_0_zero_x, %v11_conv_0_zero_y, %v11_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 240, 8, 8), int32] */;
  %71 = nn.mcutruncate(%70) /* ty=Tensor[(1, 240, 8, 8), int8] */;
  %72 = nn.mcuconv2d(%71, %v11_conv_1_weight, %v11_conv_1_bias, %v11_conv_1_zero_x, %v11_conv_1_zero_y, %v11_conv_1_scale, strides=[2, 2], padding=[3, 3, 3, 3], groups=240) /* ty=Tensor[(1, 240, 4, 4), int32] */;
  %73 = nn.mcutruncate(%72) /* ty=Tensor[(1, 240, 4, 4), int8] */;
  %74 = nn.mcuconv2d(%73, %v11_conv_2_weight, %v11_conv_2_bias, %v11_conv_2_zero_x, %v11_conv_2_zero_y, %v11_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %75 = nn.mcutruncate(%74) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %76 = nn.mcuconv2d(%75, %v12_conv_0_weight, %v12_conv_0_bias, %v12_conv_0_zero_x, %v12_conv_0_zero_y, %v12_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %77 = nn.mcutruncate(%76) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %78 = nn.mcuconv2d(%77, %v12_conv_1_weight, %v12_conv_1_bias, %v12_conv_1_zero_x, %v12_conv_1_zero_y, %v12_conv_1_scale, padding=[2, 2, 2, 2], groups=384) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %79 = nn.mcutruncate(%78) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %80 = nn.mcuconv2d(%79, %v12_conv_2_weight, %v12_conv_2_bias, %v12_conv_2_zero_x, %v12_conv_2_zero_y, %v12_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %81 = nn.mcutruncate(%80) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %82 = nn.mcuadd(%75, %81, %v12_qadd_zero_x1, %v12_qadd_zero_x2, %v12_qadd_scale_x1, %v12_qadd_scale_x2, %v12_qadd_zero_y, %v12_qadd_scale_y, axis=0) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %83 = nn.mcutruncate(%82) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %84 = nn.mcuconv2d(%83, %v13_conv_0_weight, %v13_conv_0_bias, %v13_conv_0_zero_x, %v13_conv_0_zero_y, %v13_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %85 = nn.mcutruncate(%84) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %86 = nn.mcuconv2d(%85, %v13_conv_1_weight, %v13_conv_1_bias, %v13_conv_1_zero_x, %v13_conv_1_zero_y, %v13_conv_1_scale, padding=[2, 2, 2, 2], groups=384) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %87 = nn.mcutruncate(%86) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %88 = nn.mcuconv2d(%87, %v13_conv_2_weight, %v13_conv_2_bias, %v13_conv_2_zero_x, %v13_conv_2_zero_y, %v13_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %89 = nn.mcutruncate(%88) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %90 = nn.mcuadd(%83, %89, %v13_qadd_zero_x1, %v13_qadd_zero_x2, %v13_qadd_scale_x1, %v13_qadd_scale_x2, %v13_qadd_zero_y, %v13_qadd_scale_y, axis=0) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %91 = nn.mcutruncate(%90) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %92 = nn.mcuconv2d(%91, %v14_conv_0_weight, %v14_conv_0_bias, %v14_conv_0_zero_x, %v14_conv_0_zero_y, %v14_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %93 = nn.mcutruncate(%92) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %94 = nn.mcuconv2d(%93, %v14_conv_1_weight, %v14_conv_1_bias, %v14_conv_1_zero_x, %v14_conv_1_zero_y, %v14_conv_1_scale, padding=[1, 1, 1, 1], groups=576) /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %95 = nn.mcutruncate(%94) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %96 = nn.mcuconv2d(%95, %v14_conv_2_weight, %v14_conv_2_bias, %v14_conv_2_zero_x, %v14_conv_2_zero_y, %v14_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 160, 4, 4), int32] */;
  %97 = nn.mcutruncate(%96) /* ty=Tensor[(1, 160, 4, 4), int8] */;
  %98 = mcumean(%97, axis=[2, 3], keepdims=True) /* ty=Tensor[(1, 160, 1, 1), int8] */;
  %99 = nn.mcuconv2d(%98, %v15_weight, %v15_bias, %v15_zero_x, %v15_zero_y, %v15_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 10, 1, 1), int32] */;
  %100 = nn.mcutruncate(%99) /* ty=Tensor[(1, 10, 1, 1), int8] */;
  %101 = reshape(%100, newshape=[0, 0]) /* ty=Tensor[(1, 10), int8] */;
  %102 = cast(%101, dtype="float32") /* ty=Tensor[(1, 10), float32] */;
  %103 = nn.log_softmax(%102) /* ty=Tensor[(1, 10), float32] */;
  %104 = greater_equal(%99, -128 /* ty=int32 */) /* ty=Tensor[(1, 10, 1, 1), bool] */;
  %105 = less_equal(%99, 127 /* ty=int32 */) /* ty=Tensor[(1, 10, 1, 1), bool] */;
  %106 = ones(shape=[], dtype="float32") /* ty=float32 */;
  %107 = negative(%106) /* ty=float32 */;
  %108 = multiply(%107, %label) /* ty=Tensor[(1, 10), float32] */;
  %109 = sum(%108, axis=[-1], keepdims=True) /* ty=Tensor[(1, 1), float32] */;
  %110 = exp(%103) /* ty=Tensor[(1, 10), float32] */;
  %111 = multiply(%109, %110) /* ty=Tensor[(1, 10), float32] */;
  %112 = subtract(%108, %111) /* ty=Tensor[(1, 10), float32] */;
  %113 = multiply(%104, %105) /* ty=Tensor[(1, 10, 1, 1), bool] */;
  %114 = reshape(%112, newshape=[1, 10, 1, 1]) /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %115 = zeros(shape=[1, 10, 1, 1], dtype="float32") /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %116 = where(%113, %114, %115) /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %117 = cast(%116, dtype="int32") /* ty=Tensor[(1, 10, 1, 1), int32] */;
  %118 = reshape(%98, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 160, 1, 1), int8] */;
  %119 = tile(%116, reps=[1, 160, 1, 1]) /* ty=Tensor[(1, 1600, 1, 1), float32] */;
  %120 = cast(%118, dtype="float32") /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %121 = reshape(%119, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(1600, 1, 1, 1), float32] */;
  %122 = nn.conv2d(%120, %121, padding=[0, 0, 0, 0], groups=160, out_dtype="float32") /* ty=Tensor[(1, 1600, 1, 1), float32] */;
  %123 = reshape(%122, newshape=[1, 160, 10, 1, 1]) /* ty=Tensor[(1, 160, 10, 1, 1), float32] */;
  %124 = sum(%123, axis=[0]) /* ty=Tensor[(160, 10, 1, 1), float32] */;
  %125 = transpose(%124, axes=[1, 0, 2, 3]) /* ty=Tensor[(10, 160, 1, 1), float32] */;
  %126 = abs(%125) /* ty=Tensor[(10, 160, 1, 1), float32] */;
  %127 = max(%126, axis=[1], keepdims=True) /* ty=Tensor[(10, 1, 1, 1), float32] */;
  %128 = divide(%127, 127f /* ty=float32 */) /* ty=Tensor[(10, 1, 1, 1), float32] */;
  %129 = divide(%125, %128) /* ty=Tensor[(10, 160, 1, 1), float32] */;
  %130 = greater_equal(%96, -128 /* ty=int32 */) /* ty=Tensor[(1, 160, 4, 4), bool] */;
  %131 = less_equal(%96, 127 /* ty=int32 */) /* ty=Tensor[(1, 160, 4, 4), bool] */;
  %132 = cast(%v15_weight, dtype="float32") /* ty=Tensor[(10, 160, 1, 1), float32] */;
  %133 = nn.conv2d_transpose(%116, %132, channels=160, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="float32") /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %134 = abs(%133) /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %135 = max(%134, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %136 = divide(%135, 127f /* ty=float32 */) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %137 = divide(%133, %136) /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %138 = cast(%137, dtype="int8") /* ty=Tensor[(1, 160, 1, 1), int8] */;
  %139 = cast(%138, dtype="float32") /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %140 = multiply(%139, 0.0625f /* ty=float32 */) /* ty=Tensor[(1, 160, 1, 1), float32] */;
  %141 = ones(shape=[1, 160, 4, 4], dtype="float32") /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %142 = multiply(%130, %131) /* ty=Tensor[(1, 160, 4, 4), bool] */;
  %143 = multiply(%140, %141) /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %144 = zeros(shape=[1, 160, 4, 4], dtype="float32") /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %145 = where(%142, %143, %144) /* ty=Tensor[(1, 160, 4, 4), float32] */;
  %146 = cast(%145, dtype="int32") /* ty=Tensor[(1, 160, 4, 4), int32] */;
  %147 = greater_equal(%94, -128 /* ty=int32 */) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %148 = less_equal(%94, 127 /* ty=int32 */) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %149 = cast(%v14_conv_2_weight, dtype="float32") /* ty=Tensor[(160, 576, 1, 1), float32] */;
  %150 = nn.conv2d_transpose(%145, %149, channels=576, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="float32") /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %151 = abs(%150) /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %152 = max(%151, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), float32] */;
  %153 = divide(%152, 127f /* ty=float32 */) /* ty=Tensor[(1, 1, 4, 4), float32] */;
  %154 = divide(%150, %153) /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %155 = multiply(%147, %148) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %156 = cast(%154, dtype="int8") /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %157 = zeros(shape=[1, 576, 4, 4], dtype="int8") /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %158 = where(%155, %156, %157) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %159 = cast(%158, dtype="int32") /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %160 = greater_equal(%92, -128 /* ty=int32 */) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %161 = less_equal(%92, 127 /* ty=int32 */) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %162 = nn.conv2d_transpose(%158, %v14_conv_1_weight, channels=576, kernel_size=[3, 3], padding=[1, 1, 1, 1], groups=576, kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %163 = abs(%162) /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %164 = max(%163, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %165 = divide(%164, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %166 = divide(%162, %165) /* ty=Tensor[(1, 576, 4, 4), int32] */;
  %167 = multiply(%160, %161) /* ty=Tensor[(1, 576, 4, 4), bool] */;
  %168 = cast(%166, dtype="int8") /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %169 = zeros(shape=[1, 576, 4, 4], dtype="int8") /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %170 = where(%167, %168, %169) /* ty=Tensor[(1, 576, 4, 4), int8] */;
  %171 = cast(%170, dtype="float32") /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %172 = reshape(%v14_conv_0_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 576, 1, 1), float32] */;
  %173 = multiply(%171, %172) /* ty=Tensor[(1, 576, 4, 4), float32] */;
  %174 = cast(%91, dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %175 = strided_slice(%174, begin=[0, 0, 0, 0], end=[1, 48, 4, 4], strides=[1], axes=None) /* ty=Tensor[(1, 48, 4, 4), float32] */;
  %176 = tile(%173, reps=[1, 48, 1, 1]) /* ty=Tensor[(1, 27648, 4, 4), float32] */;
  %177 = reshape(%175, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 48, 4, 4), float32] */;
  %178 = reshape(%176, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(27648, 1, 4, 4), float32] */;
  %179 = nn.conv2d(%177, %178, padding=[0, 0, 0, 0], groups=48) /* ty=Tensor[(1, 27648, 1, 1), float32] */;
  %180 = reshape(%179, newshape=[1, 48, 576, 1, 1]) /* ty=Tensor[(1, 48, 576, 1, 1), float32] */;
  %181 = sum(%180, axis=[0]) /* ty=Tensor[(48, 576, 1, 1), float32] */;
  %182 = greater_equal(%88, -128 /* ty=int32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %183 = less_equal(%88, 127 /* ty=int32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %184 = greater_equal(%90, meta[relay.Constant][0] /* ty=int8 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %185 = less_equal(%90, meta[relay.Constant][1] /* ty=int8 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %186 = cast(%v14_conv_0_weight, dtype="float32") /* ty=Tensor[(576, 96, 1, 1), float32] */;
  %187 = multiply(%184, %185) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %188 = nn.conv2d_transpose(%173, %186, channels=96, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %189 = zeros(shape=[1, 96, 4, 4], dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %190 = where(%187, %188, %189) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %191 = reshape(%v13_qadd_scale_y, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %192 = divide(%190, %191) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %193 = reshape(%v13_qadd_scale_x2, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %194 = multiply(%182, %183) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %195 = multiply(%192, %193) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %196 = zeros(shape=[1, 96, 4, 4], dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %197 = where(%194, %195, %196) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %198 = cast(%197, dtype="int32") /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %199 = greater_equal(%86, -128 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %200 = less_equal(%86, 127 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %201 = cast(%v13_conv_2_weight, dtype="float32") /* ty=Tensor[(96, 384, 1, 1), float32] */;
  %202 = nn.conv2d_transpose(%197, %201, channels=384, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="float32") /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %203 = abs(%202) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %204 = max(%203, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), float32] */;
  %205 = divide(%204, 127f /* ty=float32 */) /* ty=Tensor[(1, 1, 4, 4), float32] */;
  %206 = divide(%202, %205) /* ty=Tensor[(1, 384, 4, 4), float32] */;
  %207 = multiply(%199, %200) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %208 = cast(%206, dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %209 = zeros(shape=[1, 384, 4, 4], dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %210 = where(%207, %208, %209) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %211 = cast(%210, dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %212 = greater_equal(%84, -128 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %213 = less_equal(%84, 127 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %214 = nn.conv2d_transpose(%210, %v13_conv_1_weight, channels=384, kernel_size=[5, 5], padding=[2, 2, 2, 2], groups=384, kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %215 = abs(%214) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %216 = max(%215, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %217 = divide(%216, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %218 = divide(%214, %217) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %219 = multiply(%212, %213) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %220 = cast(%218, dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %221 = zeros(shape=[1, 384, 4, 4], dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %222 = where(%219, %220, %221) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %223 = cast(%222, dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %224 = tile(%222, reps=[1, 96, 1, 1]) /* ty=Tensor[(1, 36864, 4, 4), int8] */;
  %225 = reshape(%83, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %226 = reshape(%224, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(36864, 1, 4, 4), int8] */;
  %227 = nn.conv2d(%225, %226, padding=[0, 0, 0, 0], groups=96, out_dtype="int32") /* ty=Tensor[(1, 36864, 1, 1), int32] */;
  %228 = reshape(%227, newshape=[1, 96, 384, 1, 1]) /* ty=Tensor[(1, 96, 384, 1, 1), int32] */;
  %229 = sum(%228, axis=[0]) /* ty=Tensor[(96, 384, 1, 1), int32] */;
  %230 = transpose(%229, axes=[1, 0, 2, 3]) /* ty=Tensor[(384, 96, 1, 1), int32] */;
  %231 = abs(%230) /* ty=Tensor[(384, 96, 1, 1), int32] */;
  %232 = max(%231, axis=[1], keepdims=True) /* ty=Tensor[(384, 1, 1, 1), int32] */;
  %233 = divide(%232, 127 /* ty=int32 */) /* ty=Tensor[(384, 1, 1, 1), int32] */;
  %234 = divide(%230, %233) /* ty=Tensor[(384, 96, 1, 1), int32] */;
  %235 = greater_equal(%80, -128 /* ty=int32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %236 = less_equal(%80, 127 /* ty=int32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %237 = greater_equal(%82, meta[relay.Constant][2] /* ty=int8 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %238 = less_equal(%82, meta[relay.Constant][3] /* ty=int8 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %239 = nn.conv2d_transpose(%222, %v13_conv_0_weight, channels=96, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %240 = abs(%239) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %241 = max(%240, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %242 = divide(%241, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %243 = divide(%239, %242) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %244 = multiply(%237, %238) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %245 = cast(%243, dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %246 = zeros(shape=[1, 96, 4, 4], dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %247 = where(%244, %245, %246) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %248 = cast(%247, dtype="float32") /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %249 = reshape(%v12_qadd_scale_y, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %250 = divide(%248, %249) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %251 = reshape(%v12_qadd_scale_x2, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %252 = multiply(%250, %251) /* ty=Tensor[(1, 96, 4, 4), float32] */;
  %253 = multiply(%235, %236) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %254 = cast(%252, dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %255 = zeros(shape=[1, 96, 4, 4], dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %256 = where(%253, %254, %255) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %257 = cast(%256, dtype="int32") /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %258 = greater_equal(%78, -128 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %259 = less_equal(%78, 127 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %260 = nn.conv2d_transpose(%256, %v12_conv_2_weight, channels=384, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %261 = abs(%260) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %262 = max(%261, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %263 = divide(%262, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %264 = divide(%260, %263) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %265 = multiply(%258, %259) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %266 = cast(%264, dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %267 = zeros(shape=[1, 384, 4, 4], dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %268 = where(%265, %266, %267) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %269 = cast(%268, dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %270 = greater_equal(%76, -128 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %271 = less_equal(%76, 127 /* ty=int32 */) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %272 = nn.conv2d_transpose(%268, %v12_conv_1_weight, channels=384, kernel_size=[5, 5], padding=[2, 2, 2, 2], groups=384, kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %273 = abs(%272) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %274 = max(%273, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %275 = divide(%274, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %276 = divide(%272, %275) /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %277 = multiply(%270, %271) /* ty=Tensor[(1, 384, 4, 4), bool] */;
  %278 = cast(%276, dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %279 = zeros(shape=[1, 384, 4, 4], dtype="int8") /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %280 = where(%277, %278, %279) /* ty=Tensor[(1, 384, 4, 4), int8] */;
  %281 = cast(%280, dtype="int32") /* ty=Tensor[(1, 384, 4, 4), int32] */;
  %282 = greater_equal(%74, -128 /* ty=int32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %283 = less_equal(%74, 127 /* ty=int32 */) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %284 = nn.conv2d_transpose(%280, %v12_conv_0_weight, channels=96, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %285 = abs(%284) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %286 = max(%285, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %287 = divide(%286, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %288 = divide(%284, %287) /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %289 = multiply(%282, %283) /* ty=Tensor[(1, 96, 4, 4), bool] */;
  %290 = cast(%288, dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %291 = zeros(shape=[1, 96, 4, 4], dtype="int8") /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %292 = where(%289, %290, %291) /* ty=Tensor[(1, 96, 4, 4), int8] */;
  %293 = cast(%292, dtype="int32") /* ty=Tensor[(1, 96, 4, 4), int32] */;
  %294 = greater_equal(%72, -128 /* ty=int32 */) /* ty=Tensor[(1, 240, 4, 4), bool] */;
  %295 = less_equal(%72, 127 /* ty=int32 */) /* ty=Tensor[(1, 240, 4, 4), bool] */;
  %296 = nn.conv2d_transpose(%292, %v11_conv_2_weight, channels=240, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 240, 4, 4), int32] */;
  %297 = abs(%296) /* ty=Tensor[(1, 240, 4, 4), int32] */;
  %298 = max(%297, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %299 = divide(%298, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 4, 4), int32] */;
  %300 = divide(%296, %299) /* ty=Tensor[(1, 240, 4, 4), int32] */;
  %301 = multiply(%294, %295) /* ty=Tensor[(1, 240, 4, 4), bool] */;
  %302 = cast(%300, dtype="int8") /* ty=Tensor[(1, 240, 4, 4), int8] */;
  %303 = zeros(shape=[1, 240, 4, 4], dtype="int8") /* ty=Tensor[(1, 240, 4, 4), int8] */;
  %304 = where(%301, %302, %303) /* ty=Tensor[(1, 240, 4, 4), int8] */;
  %305 = cast(%304, dtype="int32") /* ty=Tensor[(1, 240, 4, 4), int32] */;
  %306 = greater_equal(%70, -128 /* ty=int32 */) /* ty=Tensor[(1, 240, 8, 8), bool] */;
  %307 = less_equal(%70, 127 /* ty=int32 */) /* ty=Tensor[(1, 240, 8, 8), bool] */;
  %308 = nn.conv2d_transpose(%304, %v11_conv_1_weight, channels=240, kernel_size=[7, 7], strides=[2, 2], output_padding=[1, 1], padding=[3, 3, 3, 3], groups=240, kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 240, 8, 8), int32] */;
  %309 = abs(%308) /* ty=Tensor[(1, 240, 8, 8), int32] */;
  %310 = max(%309, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 8, 8), int32] */;
  %311 = divide(%310, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 8, 8), int32] */;
  %312 = divide(%308, %311) /* ty=Tensor[(1, 240, 8, 8), int32] */;
  %313 = multiply(%306, %307) /* ty=Tensor[(1, 240, 8, 8), bool] */;
  %314 = cast(%312, dtype="int8") /* ty=Tensor[(1, 240, 8, 8), int8] */;
  %315 = zeros(shape=[1, 240, 8, 8], dtype="int8") /* ty=Tensor[(1, 240, 8, 8), int8] */;
  %316 = where(%313, %314, %315) /* ty=Tensor[(1, 240, 8, 8), int8] */;
  %317 = cast(%316, dtype="int32") /* ty=Tensor[(1, 240, 8, 8), int32] */;
  %318 = tile(%316, reps=[1, 48, 1, 1]) /* ty=Tensor[(1, 11520, 8, 8), int8] */;
  %319 = reshape(%69, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %320 = reshape(%318, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(11520, 1, 8, 8), int8] */;
  %321 = nn.conv2d(%319, %320, padding=[0, 0, 0, 0], groups=48, out_dtype="int32") /* ty=Tensor[(1, 11520, 1, 1), int32] */;
  %322 = reshape(%321, newshape=[1, 48, 240, 1, 1]) /* ty=Tensor[(1, 48, 240, 1, 1), int32] */;
  %323 = sum(%322, axis=[0]) /* ty=Tensor[(48, 240, 1, 1), int32] */;
  %324 = transpose(%323, axes=[1, 0, 2, 3]) /* ty=Tensor[(240, 48, 1, 1), int32] */;
  %325 = abs(%324) /* ty=Tensor[(240, 48, 1, 1), int32] */;
  %326 = max(%325, axis=[1], keepdims=True) /* ty=Tensor[(240, 1, 1, 1), int32] */;
  %327 = divide(%326, 127 /* ty=int32 */) /* ty=Tensor[(240, 1, 1, 1), int32] */;
  %328 = divide(%324, %327) /* ty=Tensor[(240, 48, 1, 1), int32] */;
  %329 = greater_equal(%66, -128 /* ty=int32 */) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %330 = less_equal(%66, 127 /* ty=int32 */) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %331 = greater_equal(%68, meta[relay.Constant][4] /* ty=int8 */) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %332 = less_equal(%68, meta[relay.Constant][5] /* ty=int8 */) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %333 = nn.conv2d_transpose(%316, %v11_conv_0_weight, channels=48, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %334 = abs(%333) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %335 = max(%334, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 8, 8), int32] */;
  %336 = divide(%335, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 8, 8), int32] */;
  %337 = divide(%333, %336) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %338 = multiply(%331, %332) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %339 = cast(%337, dtype="int8") /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %340 = zeros(shape=[1, 48, 8, 8], dtype="int8") /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %341 = where(%338, %339, %340) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %342 = cast(%341, dtype="float32") /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %343 = reshape(%v10_qadd_scale_y, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %344 = divide(%342, %343) /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %345 = reshape(%v10_qadd_scale_x2, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %346 = multiply(%344, %345) /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %347 = multiply(%329, %330) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %348 = cast(%346, dtype="int8") /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %349 = zeros(shape=[1, 48, 8, 8], dtype="int8") /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %350 = where(%347, %348, %349) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %351 = cast(%350, dtype="int32") /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %352 = greater_equal(%64, -128 /* ty=int32 */) /* ty=Tensor[(1, 192, 8, 8), bool] */;
  %353 = less_equal(%64, 127 /* ty=int32 */) /* ty=Tensor[(1, 192, 8, 8), bool] */;
  %354 = nn.conv2d_transpose(%350, %v10_conv_2_weight, channels=192, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %355 = abs(%354) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %356 = max(%355, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 8, 8), int32] */;
  %357 = divide(%356, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 8, 8), int32] */;
  %358 = divide(%354, %357) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %359 = multiply(%352, %353) /* ty=Tensor[(1, 192, 8, 8), bool] */;
  %360 = cast(%358, dtype="int8") /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %361 = zeros(shape=[1, 192, 8, 8], dtype="int8") /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %362 = where(%359, %360, %361) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %363 = cast(%362, dtype="int32") /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %364 = greater_equal(%62, -128 /* ty=int32 */) /* ty=Tensor[(1, 192, 8, 8), bool] */;
  %365 = less_equal(%62, 127 /* ty=int32 */) /* ty=Tensor[(1, 192, 8, 8), bool] */;
  %366 = nn.conv2d_transpose(%362, %v10_conv_1_weight, channels=192, kernel_size=[3, 3], padding=[1, 1, 1, 1], groups=192, kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %367 = abs(%366) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %368 = max(%367, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 8, 8), int32] */;
  %369 = divide(%368, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 8, 8), int32] */;
  %370 = divide(%366, %369) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %371 = multiply(%364, %365) /* ty=Tensor[(1, 192, 8, 8), bool] */;
  %372 = cast(%370, dtype="int8") /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %373 = zeros(shape=[1, 192, 8, 8], dtype="int8") /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %374 = where(%371, %372, %373) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %375 = cast(%374, dtype="int32") /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %376 = tile(%374, reps=[1, 48, 1, 1]) /* ty=Tensor[(1, 9216, 8, 8), int8] */;
  %377 = reshape(%61, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %378 = reshape(%376, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(9216, 1, 8, 8), int8] */;
  %379 = nn.conv2d(%377, %378, padding=[0, 0, 0, 0], groups=48, out_dtype="int32") /* ty=Tensor[(1, 9216, 1, 1), int32] */;
  %380 = reshape(%379, newshape=[1, 48, 192, 1, 1]) /* ty=Tensor[(1, 48, 192, 1, 1), int32] */;
  %381 = sum(%380, axis=[0]) /* ty=Tensor[(48, 192, 1, 1), int32] */;
  %382 = transpose(%381, axes=[1, 0, 2, 3]) /* ty=Tensor[(192, 48, 1, 1), int32] */;
  %383 = abs(%382) /* ty=Tensor[(192, 48, 1, 1), int32] */;
  %384 = max(%383, axis=[1], keepdims=True) /* ty=Tensor[(192, 1, 1, 1), int32] */;
  %385 = divide(%384, 127 /* ty=int32 */) /* ty=Tensor[(192, 1, 1, 1), int32] */;
  %386 = divide(%382, %385) /* ty=Tensor[(192, 48, 1, 1), int32] */;
  %387 = greater_equal(%58, -128 /* ty=int32 */) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %388 = less_equal(%58, 127 /* ty=int32 */) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %389 = greater_equal(%60, meta[relay.Constant][6] /* ty=int8 */) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %390 = less_equal(%60, meta[relay.Constant][7] /* ty=int8 */) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %391 = nn.conv2d_transpose(%374, %v10_conv_0_weight, channels=48, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW", out_dtype="int32") /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %392 = abs(%391) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %393 = max(%392, axis=[1], keepdims=True) /* ty=Tensor[(1, 1, 8, 8), int32] */;
  %394 = divide(%393, 127 /* ty=int32 */) /* ty=Tensor[(1, 1, 8, 8), int32] */;
  %395 = divide(%391, %394) /* ty=Tensor[(1, 48, 8, 8), int32] */;
  %396 = multiply(%389, %390) /* ty=Tensor[(1, 48, 8, 8), bool] */;
  %397 = cast(%395, dtype="int8") /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %398 = zeros(shape=[1, 48, 8, 8], dtype="int8") /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %399 = where(%396, %397, %398) /* ty=Tensor[(1, 48, 8, 8), int8] */;
  %400 = cast(%399, dtype="float32") /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %401 = reshape(%v9_qadd_scale_y, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %402 = divide(%400, %401) /* ty=Tensor[(1, 48, 8, 8), float32] */;
  %403 = reshape(%v9_qadd_scale_x2, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
